SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_mindpwm.h
/***********************************************************************************************************************
    @file     reg_mindpwm.h
    @author   VV TEAM
    @brief    This flie contains all the MINDPWM's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_MINDPWM_H
#define __REG_MINDPWM_H


/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "core_starmc1.h"



/**
  * @brief MindPWM Base Address Definition
  */
#define  MindPWM_BASE                              0x40016800                                       /*!<Base Address: 0x40016800*/

/**
  * @brief MindPWM Register Structure Definition
  */
typedef struct
{
    struct 
    {
        __IO uint32_t CR0;                         /*!<                                               offset: 0x00       */
        __IO uint32_t CR1;                         /*!<                                               offset: 0x04       */
        __IO uint32_t OCR;                         /*!<                                               offset: 0x08       */
        __IO uint32_t CNT;                         /*!<                                               offset: 0x0C       */
        __IO uint32_t INIT;                        /*!<                                               offset: 0x10       */
        __IO uint32_t VAL0;                        /*!<                                               offset: 0x14       */
        __IO uint32_t VAL1;                        /*!<                                               offset: 0x18       */
        __IO uint32_t VAL2;                        /*!<                                               offset: 0x1C       */
        __IO uint32_t VAL3;                        /*!<                                               offset: 0x20       */
        __IO uint32_t VAL4;                        /*!<                                               offset: 0x24       */
        __IO uint32_t VAL5;                        /*!<                                               offset: 0x28       */
        __IO uint32_t FRCR0;                       /*!<                                               offset: 0x2C       */
        __IO uint32_t FRCR1;                       /*!<                                               offset: 0x30       */
        __IO uint32_t SR;                          /*!<                                               offset: 0x34       */
        __IO uint32_t INTE;                        /*!<                                               offset: 0x38       */
        __IO uint32_t DMAE;                        /*!<                                               offset: 0x3C       */
        __IO uint32_t TRGCR;                       /*!<                                               offset: 0x40       */
        __IO uint32_t FDIS0;                       /*!<                                               offset: 0x44       */
        __IO uint32_t FDIS1;                       /*!<                                               offset: 0x48       */
        __IO uint32_t DTCNT;                       /*!<                                               offset: 0x4C       */
        __IO uint32_t CAPTCRX;                     /*!<                                               offset: 0x50       */
        __IO uint32_t CAPTCRA;                     /*!<                                               offset: 0x54       */
        __IO uint32_t CAPTCRB;                     /*!<                                               offset: 0x58       */
        __IO uint32_t CVAL0;                       /*!<                                               offset: 0x5C       */
        __IO uint32_t CVAL1;                       /*!<                                               offset: 0x60       */
        __IO uint32_t CVAL2;                       /*!<                                               offset: 0x64       */
        __IO uint32_t CVAL3;                       /*!<                                               offset: 0x68       */
        __IO uint32_t CVAL4;                       /*!<                                               offset: 0x6C       */
        __IO uint32_t CVAL5;                       /*!<                                               offset: 0x70       */
        __IO uint32_t CCYC0;                       /*!<                                               offset: 0x74       */
        __IO uint32_t CCYC1;                       /*!<                                               offset: 0x78       */
        __IO uint32_t CCYC2;                       /*!<                                               offset: 0x7C       */
    }SM[4];
    __IO uint32_t GCR0;                           /*!<                                               offset: 0x200      */
    __IO uint32_t GCR1;                           /*!<                                               offset: 0x204      */
    __IO uint32_t DTCR;                           /*!<                                               offset: 0x208      */
    __IO uint32_t RESERVED0x20C[1];               /*!<                                               offset: 0x20C      */
    __IO uint32_t FC0CR0;                         /*!<                                               offset: 0x210      */
    __IO uint32_t FC0CR1;                         /*!<                                               offset: 0x214      */
    __IO uint32_t RESERVED0x218[2];               /*!<                                               offset: 0x218~0x21C*/
    __IO uint32_t FC1CR0;                         /*!<                                               offset: 0x220      */
    __IO uint32_t FC1CR1;                         /*!<                                               offset: 0x224      */
    __IO uint32_t RESERVED0x228[2];               /*!<                                               offset: 0x228~0x22C*/
    __IO uint32_t FC2CR0;                         /*!<                                               offset: 0x230      */
    __IO uint32_t FC2CR1;                         /*!<                                               offset: 0x234      */
    __IO uint32_t RESERVED0x238[2];               /*!<                                               offset: 0x238~0x23C*/
    __IO uint32_t FC3CR0;                         /*!<                                               offset: 0x240      */
    __IO uint32_t FC3CR1;                         /*!<                                               offset: 0x244      */
} MindPWM_TypeDef;

/**
  * @brief MindPWM type pointer Definition
  */
#define MindPWM                                   ((MindPWM_TypeDef *)MindPWM_BASE)

/**
  * @brief MindPWM_SMCR0 Register Bit Definition
  */
#define  MindPWM_SMCR0_CLK_SEL_Pos                (0)
#define  MindPWM_SMCR0_CLK_SEL_Msk                (0x3U << MindPWM_SMCR0_CLK_SEL_Pos)               /*!<*/
#define  MindPWM_SMCR0_CLK_SEL                    MindPWM_SMCR0_CLK_SEL_Msk
#define  MindPWM_SMCR0_CLK_SEL_Bit0               (0x1U << MindPWM_SMCR0_CLK_SEL_Pos) 
#define  MindPWM_SMCR0_CLK_SEL_Bit1               (0x2U << MindPWM_SMCR0_CLK_SEL_Pos) 
#define  MindPWM_SMCR0_PRSC_Pos                   (2)
#define  MindPWM_SMCR0_PRSC_Msk                   (0x7U << MindPWM_SMCR0_PRSC_Pos)                  /*!<*/
#define  MindPWM_SMCR0_PRSC                       MindPWM_SMCR0_PRSC_Msk
#define  MindPWM_SMCR0_PRSC_Bit0                  (0x1U << MindPWM_SMCR0_PRSC_Pos) 
#define  MindPWM_SMCR0_PRSC_Bit1                  (0x2U << MindPWM_SMCR0_PRSC_Pos) 
#define  MindPWM_SMCR0_PRSC_Bit2                  (0x4U << MindPWM_SMCR0_PRSC_Pos) 
#define  MindPWM_SMCR0_FORCE_SEL_Pos              (8)
#define  MindPWM_SMCR0_FORCE_SEL_Msk              (0x7U << MindPWM_SMCR0_FORCE_SEL_Pos)             /*!<*/
#define  MindPWM_SMCR0_FORCE_SEL                  MindPWM_SMCR0_FORCE_SEL_Msk
#define  MindPWM_SMCR0_FORCE_SEL_Bit0             (0x1U << MindPWM_SMCR0_FORCE_SEL_Pos) 
#define  MindPWM_SMCR0_FORCE_SEL_Bit1             (0x2U << MindPWM_SMCR0_FORCE_SEL_Pos) 
#define  MindPWM_SMCR0_FORCE_SEL_Bit2             (0x4U << MindPWM_SMCR0_FORCE_SEL_Pos) 
#define  MindPWM_SMCR0_FORCE_LOCAL_Pos            (11)
#define  MindPWM_SMCR0_FORCE_LOCAL_Msk            (0x1U << MindPWM_SMCR0_FORCE_LOCAL_Pos)           /*!<*/
#define  MindPWM_SMCR0_FORCE_LOCAL                MindPWM_SMCR0_FORCE_LOCAL_Msk
#define  MindPWM_SMCR0_FORCE_INIT_Pos             (12)
#define  MindPWM_SMCR0_FORCE_INIT_Msk             (0x1U << MindPWM_SMCR0_FORCE_INIT_Pos)            /*!<*/
#define  MindPWM_SMCR0_FORCE_INIT                 MindPWM_SMCR0_FORCE_INIT_Msk
#define  MindPWM_SMCR0_PWMX_INIT_Pos              (13)
#define  MindPWM_SMCR0_PWMX_INIT_Msk              (0x1U << MindPWM_SMCR0_PWMX_INIT_Pos)             /*!<*/
#define  MindPWM_SMCR0_PWMX_INIT                  MindPWM_SMCR0_PWMX_INIT_Msk
#define  MindPWM_SMCR0_PWMA_INIT_Pos              (14)
#define  MindPWM_SMCR0_PWMA_INIT_Msk              (0x1U << MindPWM_SMCR0_PWMA_INIT_Pos)             /*!<*/
#define  MindPWM_SMCR0_PWMA_INIT                  MindPWM_SMCR0_PWMA_INIT_Msk
#define  MindPWM_SMCR0_PWMB_INIT_Pos              (15)
#define  MindPWM_SMCR0_PWMB_INIT_Msk              (0x1U << MindPWM_SMCR0_PWMB_INIT_Pos)             /*!<*/
#define  MindPWM_SMCR0_PWMB_INIT                  MindPWM_SMCR0_PWMB_INIT_Msk
#define  MindPWM_SMCR0_INIT_SEL_Pos               (16)
#define  MindPWM_SMCR0_INIT_SEL_Msk               (0xFU << MindPWM_SMCR0_INIT_SEL_Pos)              /*!<*/
#define  MindPWM_SMCR0_INIT_SEL                   MindPWM_SMCR0_INIT_SEL_Msk
#define  MindPWM_SMCR0_INIT_SEL_Bit0              (0x1U << MindPWM_SMCR0_INIT_SEL_Pos) 
#define  MindPWM_SMCR0_INIT_SEL_Bit1              (0x2U << MindPWM_SMCR0_INIT_SEL_Pos) 
#define  MindPWM_SMCR0_INIT_SEL_Bit2              (0x4U << MindPWM_SMCR0_INIT_SEL_Pos) 
#define  MindPWM_SMCR0_INIT_SEL_Bit3              (0x8U << MindPWM_SMCR0_INIT_SEL_Pos) 
#define  MindPWM_SMCR0_RELOAD_SEL_Pos             (24)
#define  MindPWM_SMCR0_RELOAD_SEL_Msk             (0x1U << MindPWM_SMCR0_RELOAD_SEL_Pos)            /*!<*/
#define  MindPWM_SMCR0_RELOAD_SEL                 MindPWM_SMCR0_RELOAD_SEL_Msk
#define  MindPWM_SMCR0_LDMOD_Pos                  (25)
#define  MindPWM_SMCR0_LDMOD_Msk                  (0x1U << MindPWM_SMCR0_LDMOD_Pos)                 /*!<*/
#define  MindPWM_SMCR0_LDMOD                      MindPWM_SMCR0_LDMOD_Msk
#define  MindPWM_SMCR0_FULL_Pos                   (26)
#define  MindPWM_SMCR0_FULL_Msk                   (0x1U << MindPWM_SMCR0_FULL_Pos)                  /*!<*/
#define  MindPWM_SMCR0_FULL                       MindPWM_SMCR0_FULL_Msk
#define  MindPWM_SMCR0_HALF_Pos                   (27)
#define  MindPWM_SMCR0_HALF_Msk                   (0x1U << MindPWM_SMCR0_HALF_Pos)                  /*!<*/
#define  MindPWM_SMCR0_HALF                       MindPWM_SMCR0_HALF_Msk
#define  MindPWM_SMCR0_LDFQ_Pos                   (28)
#define  MindPWM_SMCR0_LDFQ_Msk                   (0xFU << MindPWM_SMCR0_LDFQ_Pos)                  /*!<*/
#define  MindPWM_SMCR0_LDFQ                       MindPWM_SMCR0_LDFQ_Msk
#define  MindPWM_SMCR0_LDFQ_Bit0                  (0x1U << MindPWM_SMCR0_LDFQ_Pos) 
#define  MindPWM_SMCR0_LDFQ_Bit1                  (0x2U << MindPWM_SMCR0_LDFQ_Pos) 
#define  MindPWM_SMCR0_LDFQ_Bit2                  (0x4U << MindPWM_SMCR0_LDFQ_Pos) 
#define  MindPWM_SMCR0_LDFQ_Bit3                  (0x8U << MindPWM_SMCR0_LDFQ_Pos) 

/**
  * @brief MindPWM_SMCR1 Register Bit Definition
  */
#define  MindPWM_SMCR1_DBLEN_Pos                  (0)
#define  MindPWM_SMCR1_DBLEN_Msk                  (0x1U << MindPWM_SMCR1_DBLEN_Pos)                 /*!<*/
#define  MindPWM_SMCR1_DBLEN                      MindPWM_SMCR1_DBLEN_Msk
#define  MindPWM_SMCR1_DBLXEN_Pos                 (1)
#define  MindPWM_SMCR1_DBLXEN_Msk                 (0x1U << MindPWM_SMCR1_DBLXEN_Pos)                /*!<*/
#define  MindPWM_SMCR1_DBLXEN                     MindPWM_SMCR1_DBLXEN_Msk
#define  MindPWM_SMCR1_SPLIT_Pos                  (2)
#define  MindPWM_SMCR1_SPLIT_Msk                  (0x1U << MindPWM_SMCR1_SPLIT_Pos)                 /*!<*/
#define  MindPWM_SMCR1_SPLIT                      MindPWM_SMCR1_SPLIT_Msk
#define  MindPWM_SMCR1_COMPMOD_Pos                (3)
#define  MindPWM_SMCR1_COMPMOD_Msk                (0x1U << MindPWM_SMCR1_COMPMOD_Pos)               /*!<*/
#define  MindPWM_SMCR1_COMPMOD                    MindPWM_SMCR1_COMPMOD_Msk
#define  MindPWM_SMCR1_INDEP_Pos                  (4)
#define  MindPWM_SMCR1_INDEP_Msk                  (0x1U << MindPWM_SMCR1_INDEP_Pos)                 /*!<*/
#define  MindPWM_SMCR1_INDEP                      MindPWM_SMCR1_INDEP_Msk
#define  MindPWM_SMCR1_DT_Pos                     (14)
#define  MindPWM_SMCR1_DT_Msk                     (0x3U << MindPWM_SMCR1_DT_Pos)                    /*!<*/
#define  MindPWM_SMCR1_DT                         MindPWM_SMCR1_DT_Msk
#define  MindPWM_SMCR1_DT_Bit0                    (0x1U << MindPWM_SMCR1_DT_Pos) 
#define  MindPWM_SMCR1_DT_Bit1                    (0x2U << MindPWM_SMCR1_DT_Pos) 
#define  MindPWM_SMCR1_UDM_Pos                    (16)
#define  MindPWM_SMCR1_UDM_Msk                    (0x3U << MindPWM_SMCR1_UDM_Pos)                   /*!<*/
#define  MindPWM_SMCR1_UDM                        MindPWM_SMCR1_UDM_Msk
#define  MindPWM_SMCR1_UDM_Bit0                   (0x1U << MindPWM_SMCR1_UDM_Pos) 
#define  MindPWM_SMCR1_UDM_Bit1                   (0x2U << MindPWM_SMCR1_UDM_Pos) 
#define  MindPWM_SMCR1_UDM_CMPUP_Pos              (20)
#define  MindPWM_SMCR1_UDM_CMPUP_Msk              (0x1U << MindPWM_SMCR1_UDM_CMPUP_Pos)             /*!<*/
#define  MindPWM_SMCR1_UDM_CMPUP                  MindPWM_SMCR1_UDM_CMPUP_Msk
#define  MindPWM_SMCR1_UDM_CMPDN_Pos              (21)
#define  MindPWM_SMCR1_UDM_CMPDN_Msk              (0x1U << MindPWM_SMCR1_UDM_CMPDN_Pos)             /*!<*/
#define  MindPWM_SMCR1_UDM_CMPDN                  MindPWM_SMCR1_UDM_CMPDN_Msk
#define  MindPWM_SMCR1_UDM_FULL_CRESTS_Pos        (22)
#define  MindPWM_SMCR1_UDM_FULL_CRESTS_Msk        (0x1U << MindPWM_SMCR1_UDM_FULL_CRESTS_Pos)       /*!<*/
#define  MindPWM_SMCR1_UDM_FULL_CRESTS            MindPWM_SMCR1_UDM_FULL_CRESTS_Msk
#define  MindPWM_SMCR1_UDM_FULL_TROUGHS_Pos       (23)
#define  MindPWM_SMCR1_UDM_FULL_TROUGHS_Msk       (0x1U << MindPWM_SMCR1_UDM_FULL_TROUGHS_Pos)      /*!<*/
#define  MindPWM_SMCR1_UDM_FULL_TROUGHS           MindPWM_SMCR1_UDM_FULL_TROUGHS_Msk

/**
  * @brief MindPWM_SMOCR Register Bit Definition
  */
#define  MindPWM_SMOCR_PWMX_FS_Pos                (0)
#define  MindPWM_SMOCR_PWMX_FS_Msk                (0x3U << MindPWM_SMOCR_PWMX_FS_Pos)               /*!<*/
#define  MindPWM_SMOCR_PWMX_FS                    MindPWM_SMOCR_PWMX_FS_Msk
#define  MindPWM_SMOCR_PWMX_FS_Bit0               (0x1U << MindPWM_SMOCR_PWMX_FS_Pos) 
#define  MindPWM_SMOCR_PWMX_FS_Bit1               (0x2U << MindPWM_SMOCR_PWMX_FS_Pos) 
#define  MindPWM_SMOCR_PWMA_FS_Pos                (2)
#define  MindPWM_SMOCR_PWMA_FS_Msk                (0x3U << MindPWM_SMOCR_PWMA_FS_Pos)               /*!<*/
#define  MindPWM_SMOCR_PWMA_FS                    MindPWM_SMOCR_PWMA_FS_Msk
#define  MindPWM_SMOCR_PWMA_FS_Bit0               (0x1U << MindPWM_SMOCR_PWMA_FS_Pos) 
#define  MindPWM_SMOCR_PWMA_FS_Bit1               (0x2U << MindPWM_SMOCR_PWMA_FS_Pos) 
#define  MindPWM_SMOCR_PWMB_FS_Pos                (4)
#define  MindPWM_SMOCR_PWMB_FS_Msk                (0x3U << MindPWM_SMOCR_PWMB_FS_Pos)               /*!<*/
#define  MindPWM_SMOCR_PWMB_FS                    MindPWM_SMOCR_PWMB_FS_Msk
#define  MindPWM_SMOCR_PWMB_FS_Bit0               (0x1U << MindPWM_SMOCR_PWMB_FS_Pos) 
#define  MindPWM_SMOCR_PWMB_FS_Bit1               (0x2U << MindPWM_SMOCR_PWMB_FS_Pos) 
#define  MindPWM_SMOCR_POLX_Pos                   (8)
#define  MindPWM_SMOCR_POLX_Msk                   (0x1U << MindPWM_SMOCR_POLX_Pos)                  /*!<*/
#define  MindPWM_SMOCR_POLX                       MindPWM_SMOCR_POLX_Msk
#define  MindPWM_SMOCR_POLA_Pos                   (9)
#define  MindPWM_SMOCR_POLA_Msk                   (0x1U << MindPWM_SMOCR_POLA_Pos)                  /*!<*/
#define  MindPWM_SMOCR_POLA                       MindPWM_SMOCR_POLA_Msk
#define  MindPWM_SMOCR_POLB_Pos                   (10)
#define  MindPWM_SMOCR_POLB_Msk                   (0x1U << MindPWM_SMOCR_POLB_Pos)                  /*!<*/
#define  MindPWM_SMOCR_POLB                       MindPWM_SMOCR_POLB_Msk
#define  MindPWM_SMOCR_PWMX_DS_Pos                (16)
#define  MindPWM_SMOCR_PWMX_DS_Msk                (0x3U << MindPWM_SMOCR_PWMX_DS_Pos)               /*!<*/
#define  MindPWM_SMOCR_PWMX_DS                    MindPWM_SMOCR_PWMX_DS_Msk
#define  MindPWM_SMOCR_PWMX_DS_Bit0               (0x1U << MindPWM_SMOCR_PWMX_DS_Pos) 
#define  MindPWM_SMOCR_PWMX_DS_Bit1               (0x2U << MindPWM_SMOCR_PWMX_DS_Pos) 
#define  MindPWM_SMOCR_PWMA_DS_Pos                (18)
#define  MindPWM_SMOCR_PWMA_DS_Msk                (0x3U << MindPWM_SMOCR_PWMA_DS_Pos)               /*!<*/
#define  MindPWM_SMOCR_PWMA_DS                    MindPWM_SMOCR_PWMA_DS_Msk
#define  MindPWM_SMOCR_PWMA_DS_Bit0               (0x1U << MindPWM_SMOCR_PWMA_DS_Pos) 
#define  MindPWM_SMOCR_PWMA_DS_Bit1               (0x2U << MindPWM_SMOCR_PWMA_DS_Pos) 
#define  MindPWM_SMOCR_PWMB_DS_Pos                (20)
#define  MindPWM_SMOCR_PWMB_DS_Msk                (0x3U << MindPWM_SMOCR_PWMB_DS_Pos)               /*!<*/
#define  MindPWM_SMOCR_PWMB_DS                    MindPWM_SMOCR_PWMB_DS_Msk
#define  MindPWM_SMOCR_PWMB_DS_Bit0               (0x1U << MindPWM_SMOCR_PWMB_DS_Pos) 
#define  MindPWM_SMOCR_PWMB_DS_Bit1               (0x2U << MindPWM_SMOCR_PWMB_DS_Pos) 
#define  MindPWM_SMOCR_SLEEPEN_Pos                (30)
#define  MindPWM_SMOCR_SLEEPEN_Msk                (0x1U << MindPWM_SMOCR_SLEEPEN_Pos)               /*!<*/
#define  MindPWM_SMOCR_SLEEPEN                    MindPWM_SMOCR_SLEEPEN_Msk
#define  MindPWM_SMOCR_DBGEN_Pos                  (31)
#define  MindPWM_SMOCR_DBGEN_Msk                  (0x1U << MindPWM_SMOCR_DBGEN_Pos)                 /*!<*/
#define  MindPWM_SMOCR_DBGEN                      MindPWM_SMOCR_DBGEN_Msk

/**
  * @brief MindPWM_SMCNT Register Bit Definition
  */
#define  MindPWM_SMCNT_CNT_Pos                    (0)
#define  MindPWM_SMCNT_CNT_Msk                    (0xFFFFU << MindPWM_SMCNT_CNT_Pos)                /*!<*/
#define  MindPWM_SMCNT_CNT                        MindPWM_SMCNT_CNT_Msk
#define  MindPWM_SMCNT_CNT_Bit0                   (0x0001U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit1                   (0x0002U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit2                   (0x0004U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit3                   (0x0008U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit4                   (0x0010U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit5                   (0x0020U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit6                   (0x0040U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit7                   (0x0080U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit8                   (0x0100U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit9                   (0x0200U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit10                  (0x0400U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit11                  (0x0800U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit12                  (0x1000U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit13                  (0x2000U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit14                  (0x4000U << MindPWM_SMCNT_CNT_Pos) 
#define  MindPWM_SMCNT_CNT_Bit15                  (0x8000U << MindPWM_SMCNT_CNT_Pos) 

/**
  * @brief MindPWM_SMINIT Register Bit Definition
  */
#define  MindPWM_SMINIT_INIT_Pos                  (0)
#define  MindPWM_SMINIT_INIT_Msk                  (0xFFFFU << MindPWM_SMINIT_INIT_Pos)              /*!<*/
#define  MindPWM_SMINIT_INIT                      MindPWM_SMINIT_INIT_Msk
#define  MindPWM_SMINIT_INIT_Bit0                 (0x0001U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit1                 (0x0002U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit2                 (0x0004U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit3                 (0x0008U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit4                 (0x0010U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit5                 (0x0020U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit6                 (0x0040U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit7                 (0x0080U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit8                 (0x0100U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit9                 (0x0200U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit10                (0x0400U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit11                (0x0800U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit12                (0x1000U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit13                (0x2000U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit14                (0x4000U << MindPWM_SMINIT_INIT_Pos) 
#define  MindPWM_SMINIT_INIT_Bit15                (0x8000U << MindPWM_SMINIT_INIT_Pos) 

