SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_mindpwm.h
/**
  * @brief MindPWM_SMVAL0 Register Bit Definition
  */
#define  MindPWM_SMVAL0_VAL0_Pos                  (0)
#define  MindPWM_SMVAL0_VAL0_Msk                  (0xFFFFU << MindPWM_SMVAL0_VAL0_Pos)              /*!<*/
#define  MindPWM_SMVAL0_VAL0                      MindPWM_SMVAL0_VAL0_Msk
#define  MindPWM_SMVAL0_VAL0_Bit0                 (0x0001U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit1                 (0x0002U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit2                 (0x0004U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit3                 (0x0008U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit4                 (0x0010U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit5                 (0x0020U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit6                 (0x0040U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit7                 (0x0080U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit8                 (0x0100U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit9                 (0x0200U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit10                (0x0400U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit11                (0x0800U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit12                (0x1000U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit13                (0x2000U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit14                (0x4000U << MindPWM_SMVAL0_VAL0_Pos) 
#define  MindPWM_SMVAL0_VAL0_Bit15                (0x8000U << MindPWM_SMVAL0_VAL0_Pos) 

/**
  * @brief MindPWM_SMVAL1 Register Bit Definition
  */
#define  MindPWM_SMVAL1_VAL1_Pos                  (0)
#define  MindPWM_SMVAL1_VAL1_Msk                  (0xFFFFU << MindPWM_SMVAL1_VAL1_Pos)              /*!<*/
#define  MindPWM_SMVAL1_VAL1                      MindPWM_SMVAL1_VAL1_Msk
#define  MindPWM_SMVAL1_VAL1_Bit0                 (0x0001U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit1                 (0x0002U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit2                 (0x0004U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit3                 (0x0008U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit4                 (0x0010U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit5                 (0x0020U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit6                 (0x0040U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit7                 (0x0080U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit8                 (0x0100U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit9                 (0x0200U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit10                (0x0400U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit11                (0x0800U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit12                (0x1000U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit13                (0x2000U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit14                (0x4000U << MindPWM_SMVAL1_VAL1_Pos) 
#define  MindPWM_SMVAL1_VAL1_Bit15                (0x8000U << MindPWM_SMVAL1_VAL1_Pos) 

/**
  * @brief MindPWM_SMVAL2 Register Bit Definition
  */
#define  MindPWM_SMVAL2_VAL2_Pos                  (0)
#define  MindPWM_SMVAL2_VAL2_Msk                  (0xFFFFU << MindPWM_SMVAL2_VAL2_Pos)              /*!<*/
#define  MindPWM_SMVAL2_VAL2                      MindPWM_SMVAL2_VAL2_Msk
#define  MindPWM_SMVAL2_VAL2_Bit0                 (0x0001U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit1                 (0x0002U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit2                 (0x0004U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit3                 (0x0008U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit4                 (0x0010U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit5                 (0x0020U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit6                 (0x0040U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit7                 (0x0080U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit8                 (0x0100U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit9                 (0x0200U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit10                (0x0400U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit11                (0x0800U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit12                (0x1000U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit13                (0x2000U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit14                (0x4000U << MindPWM_SMVAL2_VAL2_Pos) 
#define  MindPWM_SMVAL2_VAL2_Bit15                (0x8000U << MindPWM_SMVAL2_VAL2_Pos) 

/**
  * @brief MindPWM_SMVAL3 Register Bit Definition
  */
#define  MindPWM_SMVAL3_VAL3_Pos                  (0)
#define  MindPWM_SMVAL3_VAL3_Msk                  (0xFFFFU << MindPWM_SMVAL3_VAL3_Pos)              /*!<*/
#define  MindPWM_SMVAL3_VAL3                      MindPWM_SMVAL3_VAL3_Msk
#define  MindPWM_SMVAL3_VAL3_Bit0                 (0x0001U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit1                 (0x0002U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit2                 (0x0004U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit3                 (0x0008U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit4                 (0x0010U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit5                 (0x0020U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit6                 (0x0040U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit7                 (0x0080U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit8                 (0x0100U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit9                 (0x0200U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit10                (0x0400U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit11                (0x0800U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit12                (0x1000U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit13                (0x2000U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit14                (0x4000U << MindPWM_SMVAL3_VAL3_Pos) 
#define  MindPWM_SMVAL3_VAL3_Bit15                (0x8000U << MindPWM_SMVAL3_VAL3_Pos) 

/**
  * @brief MindPWM_SMVAL4 Register Bit Definition
  */
#define  MindPWM_SMVAL4_VAL4_Pos                  (0)
#define  MindPWM_SMVAL4_VAL4_Msk                  (0xFFFFU << MindPWM_SMVAL4_VAL4_Pos)              /*!<*/
#define  MindPWM_SMVAL4_VAL4                      MindPWM_SMVAL4_VAL4_Msk
#define  MindPWM_SMVAL4_VAL4_Bit0                 (0x0001U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit1                 (0x0002U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit2                 (0x0004U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit3                 (0x0008U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit4                 (0x0010U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit5                 (0x0020U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit6                 (0x0040U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit7                 (0x0080U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit8                 (0x0100U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit9                 (0x0200U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit10                (0x0400U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit11                (0x0800U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit12                (0x1000U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit13                (0x2000U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit14                (0x4000U << MindPWM_SMVAL4_VAL4_Pos) 
#define  MindPWM_SMVAL4_VAL4_Bit15                (0x8000U << MindPWM_SMVAL4_VAL4_Pos) 

/**
  * @brief MindPWM_SMVAL5 Register Bit Definition
  */
#define  MindPWM_SMVAL5_VAL5_Pos                  (0)
#define  MindPWM_SMVAL5_VAL5_Msk                  (0xFFFFU << MindPWM_SMVAL5_VAL5_Pos)              /*!<*/
#define  MindPWM_SMVAL5_VAL5                      MindPWM_SMVAL5_VAL5_Msk
#define  MindPWM_SMVAL5_VAL5_Bit0                 (0x0001U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit1                 (0x0002U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit2                 (0x0004U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit3                 (0x0008U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit4                 (0x0010U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit5                 (0x0020U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit6                 (0x0040U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit7                 (0x0080U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit8                 (0x0100U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit9                 (0x0200U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit10                (0x0400U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit11                (0x0800U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit12                (0x1000U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit13                (0x2000U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit14                (0x4000U << MindPWM_SMVAL5_VAL5_Pos) 
#define  MindPWM_SMVAL5_VAL5_Bit15                (0x8000U << MindPWM_SMVAL5_VAL5_Pos) 

/**
  * @brief MindPWM_SMFRCR0 Register Bit Definition
  */
#define  MindPWM_SMFRCR0_FRAC1_EN_Pos             (0)
#define  MindPWM_SMFRCR0_FRAC1_EN_Msk             (0x1U << MindPWM_SMFRCR0_FRAC1_EN_Pos)            /*!<*/
#define  MindPWM_SMFRCR0_FRAC1_EN                 MindPWM_SMFRCR0_FRAC1_EN_Msk
#define  MindPWM_SMFRCR0_FRAC23_EN_Pos            (1)
#define  MindPWM_SMFRCR0_FRAC23_EN_Msk            (0x1U << MindPWM_SMFRCR0_FRAC23_EN_Pos)           /*!<*/
#define  MindPWM_SMFRCR0_FRAC23_EN                MindPWM_SMFRCR0_FRAC23_EN_Msk
#define  MindPWM_SMFRCR0_FRAC45_EN_Pos            (2)
#define  MindPWM_SMFRCR0_FRAC45_EN_Msk            (0x1U << MindPWM_SMFRCR0_FRAC45_EN_Pos)           /*!<*/
#define  MindPWM_SMFRCR0_FRAC45_EN                MindPWM_SMFRCR0_FRAC45_EN_Msk
#define  MindPWM_SMFRCR0_FRAC_PU_Pos              (8)
#define  MindPWM_SMFRCR0_FRAC_PU_Msk              (0x1U << MindPWM_SMFRCR0_FRAC_PU_Pos)             /*!<*/
#define  MindPWM_SMFRCR0_FRAC_PU                  MindPWM_SMFRCR0_FRAC_PU_Msk
#define  MindPWM_SMFRCR0_FRACVAL1_Pos             (19)
#define  MindPWM_SMFRCR0_FRACVAL1_Msk             (0x1FU << MindPWM_SMFRCR0_FRACVAL1_Pos)           /*!<*/
#define  MindPWM_SMFRCR0_FRACVAL1                 MindPWM_SMFRCR0_FRACVAL1_Msk
#define  MindPWM_SMFRCR0_FRACVAL1_Bit0            (0x01U << MindPWM_SMFRCR0_FRACVAL1_Pos) 
#define  MindPWM_SMFRCR0_FRACVAL1_Bit1            (0x02U << MindPWM_SMFRCR0_FRACVAL1_Pos) 
#define  MindPWM_SMFRCR0_FRACVAL1_Bit2            (0x04U << MindPWM_SMFRCR0_FRACVAL1_Pos) 
#define  MindPWM_SMFRCR0_FRACVAL1_Bit3            (0x08U << MindPWM_SMFRCR0_FRACVAL1_Pos) 
#define  MindPWM_SMFRCR0_FRACVAL1_Bit4            (0x10U << MindPWM_SMFRCR0_FRACVAL1_Pos) 

/**
  * @brief MindPWM_SMFRCR1 Register Bit Definition
  */
#define  MindPWM_SMFRCR1_FRACVAL2_Pos             (3)
#define  MindPWM_SMFRCR1_FRACVAL2_Msk             (0x1FU << MindPWM_SMFRCR1_FRACVAL2_Pos)           /*!<*/
#define  MindPWM_SMFRCR1_FRACVAL2                 MindPWM_SMFRCR1_FRACVAL2_Msk
#define  MindPWM_SMFRCR1_FRACVAL2_Bit0            (0x01U << MindPWM_SMFRCR1_FRACVAL2_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL2_Bit1            (0x02U << MindPWM_SMFRCR1_FRACVAL2_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL2_Bit2            (0x04U << MindPWM_SMFRCR1_FRACVAL2_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL2_Bit3            (0x08U << MindPWM_SMFRCR1_FRACVAL2_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL2_Bit4            (0x10U << MindPWM_SMFRCR1_FRACVAL2_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL3_Pos             (11)
#define  MindPWM_SMFRCR1_FRACVAL3_Msk             (0x1FU << MindPWM_SMFRCR1_FRACVAL3_Pos)           /*!<*/
#define  MindPWM_SMFRCR1_FRACVAL3                 MindPWM_SMFRCR1_FRACVAL3_Msk
#define  MindPWM_SMFRCR1_FRACVAL3_Bit0            (0x01U << MindPWM_SMFRCR1_FRACVAL3_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL3_Bit1            (0x02U << MindPWM_SMFRCR1_FRACVAL3_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL3_Bit2            (0x04U << MindPWM_SMFRCR1_FRACVAL3_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL3_Bit3            (0x08U << MindPWM_SMFRCR1_FRACVAL3_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL3_Bit4            (0x10U << MindPWM_SMFRCR1_FRACVAL3_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL4_Pos             (19)
#define  MindPWM_SMFRCR1_FRACVAL4_Msk             (0x1FU << MindPWM_SMFRCR1_FRACVAL4_Pos)           /*!<*/
#define  MindPWM_SMFRCR1_FRACVAL4                 MindPWM_SMFRCR1_FRACVAL4_Msk
#define  MindPWM_SMFRCR1_FRACVAL4_Bit0            (0x01U << MindPWM_SMFRCR1_FRACVAL4_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL4_Bit1            (0x02U << MindPWM_SMFRCR1_FRACVAL4_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL4_Bit2            (0x04U << MindPWM_SMFRCR1_FRACVAL4_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL4_Bit3            (0x08U << MindPWM_SMFRCR1_FRACVAL4_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL4_Bit4            (0x10U << MindPWM_SMFRCR1_FRACVAL4_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL5_Pos             (27)
#define  MindPWM_SMFRCR1_FRACVAL5_Msk             (0x1FU << MindPWM_SMFRCR1_FRACVAL5_Pos)           /*!<*/
#define  MindPWM_SMFRCR1_FRACVAL5                 MindPWM_SMFRCR1_FRACVAL5_Msk
#define  MindPWM_SMFRCR1_FRACVAL5_Bit0            (0x01U << MindPWM_SMFRCR1_FRACVAL5_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL5_Bit1            (0x02U << MindPWM_SMFRCR1_FRACVAL5_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL5_Bit2            (0x04U << MindPWM_SMFRCR1_FRACVAL5_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL5_Bit3            (0x08U << MindPWM_SMFRCR1_FRACVAL5_Pos) 
#define  MindPWM_SMFRCR1_FRACVAL5_Bit4            (0x10U << MindPWM_SMFRCR1_FRACVAL5_Pos) 

/**
  * @brief MindPWM_SMSR Register Bit Definition
  */
#define  MindPWM_SMSR_CMP0F_Pos                   (0)
#define  MindPWM_SMSR_CMP0F_Msk                   (0x1U << MindPWM_SMSR_CMP0F_Pos)                  /*!<*/
#define  MindPWM_SMSR_CMP0F                       MindPWM_SMSR_CMP0F_Msk
#define  MindPWM_SMSR_CMP1F_Pos                   (1)
#define  MindPWM_SMSR_CMP1F_Msk                   (0x1U << MindPWM_SMSR_CMP1F_Pos)                  /*!<*/
#define  MindPWM_SMSR_CMP1F                       MindPWM_SMSR_CMP1F_Msk
#define  MindPWM_SMSR_CMP2F_Pos                   (2)
#define  MindPWM_SMSR_CMP2F_Msk                   (0x1U << MindPWM_SMSR_CMP2F_Pos)                  /*!<*/
#define  MindPWM_SMSR_CMP2F                       MindPWM_SMSR_CMP2F_Msk
#define  MindPWM_SMSR_CMP3F_Pos                   (3)
#define  MindPWM_SMSR_CMP3F_Msk                   (0x1U << MindPWM_SMSR_CMP3F_Pos)                  /*!<*/
#define  MindPWM_SMSR_CMP3F                       MindPWM_SMSR_CMP3F_Msk
#define  MindPWM_SMSR_CMP4F_Pos                   (4)
#define  MindPWM_SMSR_CMP4F_Msk                   (0x1U << MindPWM_SMSR_CMP4F_Pos)                  /*!<*/
#define  MindPWM_SMSR_CMP4F                       MindPWM_SMSR_CMP4F_Msk
#define  MindPWM_SMSR_CMP5F_Pos                   (5)
#define  MindPWM_SMSR_CMP5F_Msk                   (0x1U << MindPWM_SMSR_CMP5F_Pos)                  /*!<*/
#define  MindPWM_SMSR_CMP5F                       MindPWM_SMSR_CMP5F_Msk
#define  MindPWM_SMSR_CX0F_Pos                    (6)
#define  MindPWM_SMSR_CX0F_Msk                    (0x1U << MindPWM_SMSR_CX0F_Pos)                   /*!<*/
#define  MindPWM_SMSR_CX0F                        MindPWM_SMSR_CX0F_Msk
#define  MindPWM_SMSR_CX1F_Pos                    (7)
#define  MindPWM_SMSR_CX1F_Msk                    (0x1U << MindPWM_SMSR_CX1F_Pos)                   /*!<*/
#define  MindPWM_SMSR_CX1F                        MindPWM_SMSR_CX1F_Msk
#define  MindPWM_SMSR_CA0F_Pos                    (8)
#define  MindPWM_SMSR_CA0F_Msk                    (0x1U << MindPWM_SMSR_CA0F_Pos)                   /*!<*/
#define  MindPWM_SMSR_CA0F                        MindPWM_SMSR_CA0F_Msk
#define  MindPWM_SMSR_CA1F_Pos                    (9)
#define  MindPWM_SMSR_CA1F_Msk                    (0x1U << MindPWM_SMSR_CA1F_Pos)                   /*!<*/
#define  MindPWM_SMSR_CA1F                        MindPWM_SMSR_CA1F_Msk
#define  MindPWM_SMSR_CB0F_Pos                    (10)
#define  MindPWM_SMSR_CB0F_Msk                    (0x1U << MindPWM_SMSR_CB0F_Pos)                   /*!<*/
#define  MindPWM_SMSR_CB0F                        MindPWM_SMSR_CB0F_Msk
#define  MindPWM_SMSR_CB1F_Pos                    (11)
#define  MindPWM_SMSR_CB1F_Msk                    (0x1U << MindPWM_SMSR_CB1F_Pos)                   /*!<*/
#define  MindPWM_SMSR_CB1F                        MindPWM_SMSR_CB1F_Msk
#define  MindPWM_SMSR_RF_Pos                      (12)
#define  MindPWM_SMSR_RF_Msk                      (0x1U << MindPWM_SMSR_RF_Pos)                     /*!<*/
#define  MindPWM_SMSR_RF                          MindPWM_SMSR_RF_Msk
#define  MindPWM_SMSR_REF_Pos                     (13)
#define  MindPWM_SMSR_REF_Msk                     (0x1U << MindPWM_SMSR_REF_Pos)                    /*!<*/
#define  MindPWM_SMSR_REF                         MindPWM_SMSR_REF_Msk
#define  MindPWM_SMSR_RUF_Pos                     (14)
#define  MindPWM_SMSR_RUF_Msk                     (0x1U << MindPWM_SMSR_RUF_Pos)                    /*!<*/
#define  MindPWM_SMSR_RUF                         MindPWM_SMSR_RUF_Msk
#define  MindPWM_SMSR_PWMX_IN_Pos                 (16)
#define  MindPWM_SMSR_PWMX_IN_Msk                 (0x1U << MindPWM_SMSR_PWMX_IN_Pos)                /*!<*/
#define  MindPWM_SMSR_PWMX_IN                     MindPWM_SMSR_PWMX_IN_Msk
#define  MindPWM_SMSR_PWMA_IN_Pos                 (17)
#define  MindPWM_SMSR_PWMA_IN_Msk                 (0x1U << MindPWM_SMSR_PWMA_IN_Pos)                /*!<*/
#define  MindPWM_SMSR_PWMA_IN                     MindPWM_SMSR_PWMA_IN_Msk
#define  MindPWM_SMSR_PWMB_IN_Pos                 (18)
#define  MindPWM_SMSR_PWMB_IN_Msk                 (0x1U << MindPWM_SMSR_PWMB_IN_Pos)                /*!<*/
#define  MindPWM_SMSR_PWMB_IN                     MindPWM_SMSR_PWMB_IN_Msk

/**
  * @brief MindPWM_SMINTE Register Bit Definition
  */
#define  MindPWM_SMINTE_CMP0IE_Pos                (0)
#define  MindPWM_SMINTE_CMP0IE_Msk                (0x1U << MindPWM_SMINTE_CMP0IE_Pos)               /*!<*/
#define  MindPWM_SMINTE_CMP0IE                    MindPWM_SMINTE_CMP0IE_Msk
#define  MindPWM_SMINTE_CMP1IE_Pos                (1)
#define  MindPWM_SMINTE_CMP1IE_Msk                (0x1U << MindPWM_SMINTE_CMP1IE_Pos)               /*!<*/
#define  MindPWM_SMINTE_CMP1IE                    MindPWM_SMINTE_CMP1IE_Msk
#define  MindPWM_SMINTE_CMP2IE_Pos                (2)
#define  MindPWM_SMINTE_CMP2IE_Msk                (0x1U << MindPWM_SMINTE_CMP2IE_Pos)               /*!<*/
#define  MindPWM_SMINTE_CMP2IE                    MindPWM_SMINTE_CMP2IE_Msk
#define  MindPWM_SMINTE_CMP3IE_Pos                (3)
#define  MindPWM_SMINTE_CMP3IE_Msk                (0x1U << MindPWM_SMINTE_CMP3IE_Pos)               /*!<*/
#define  MindPWM_SMINTE_CMP3IE                    MindPWM_SMINTE_CMP3IE_Msk
#define  MindPWM_SMINTE_CMP4IE_Pos                (4)
#define  MindPWM_SMINTE_CMP4IE_Msk                (0x1U << MindPWM_SMINTE_CMP4IE_Pos)               /*!<*/
#define  MindPWM_SMINTE_CMP4IE                    MindPWM_SMINTE_CMP4IE_Msk
#define  MindPWM_SMINTE_CMP5IE_Pos                (5)
#define  MindPWM_SMINTE_CMP5IE_Msk                (0x1U << MindPWM_SMINTE_CMP5IE_Pos)               /*!<*/
#define  MindPWM_SMINTE_CMP5IE                    MindPWM_SMINTE_CMP5IE_Msk
#define  MindPWM_SMINTE_CX0IE_Pos                 (6)
#define  MindPWM_SMINTE_CX0IE_Msk                 (0x1U << MindPWM_SMINTE_CX0IE_Pos)                /*!<*/
#define  MindPWM_SMINTE_CX0IE                     MindPWM_SMINTE_CX0IE_Msk
#define  MindPWM_SMINTE_CX1IE_Pos                 (7)
#define  MindPWM_SMINTE_CX1IE_Msk                 (0x1U << MindPWM_SMINTE_CX1IE_Pos)                /*!<*/
#define  MindPWM_SMINTE_CX1IE                     MindPWM_SMINTE_CX1IE_Msk
#define  MindPWM_SMINTE_CA0IE_Pos                 (8)
#define  MindPWM_SMINTE_CA0IE_Msk                 (0x1U << MindPWM_SMINTE_CA0IE_Pos)                /*!<*/
#define  MindPWM_SMINTE_CA0IE                     MindPWM_SMINTE_CA0IE_Msk
#define  MindPWM_SMINTE_CA1IE_Pos                 (9)
#define  MindPWM_SMINTE_CA1IE_Msk                 (0x1U << MindPWM_SMINTE_CA1IE_Pos)                /*!<*/
#define  MindPWM_SMINTE_CA1IE                     MindPWM_SMINTE_CA1IE_Msk
#define  MindPWM_SMINTE_CB0IE_Pos                 (10)
#define  MindPWM_SMINTE_CB0IE_Msk                 (0x1U << MindPWM_SMINTE_CB0IE_Pos)                /*!<*/
#define  MindPWM_SMINTE_CB0IE                     MindPWM_SMINTE_CB0IE_Msk
#define  MindPWM_SMINTE_CB1IE_Pos                 (11)
#define  MindPWM_SMINTE_CB1IE_Msk                 (0x1U << MindPWM_SMINTE_CB1IE_Pos)                /*!<*/
#define  MindPWM_SMINTE_CB1IE                     MindPWM_SMINTE_CB1IE_Msk
#define  MindPWM_SMINTE_RIE_Pos                   (12)
#define  MindPWM_SMINTE_RIE_Msk                   (0x1U << MindPWM_SMINTE_RIE_Pos)                  /*!<*/
#define  MindPWM_SMINTE_RIE                       MindPWM_SMINTE_RIE_Msk
#define  MindPWM_SMINTE_REIE_Pos                  (13)
#define  MindPWM_SMINTE_REIE_Msk                  (0x1U << MindPWM_SMINTE_REIE_Pos)                 /*!<*/
#define  MindPWM_SMINTE_REIE                      MindPWM_SMINTE_REIE_Msk

