SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_mindpwm.h
/**
  * @brief MindPWM_SMDMAE Register Bit Definition
  */
#define  MindPWM_SMDMAE_CX0DE_Pos                 (0)
#define  MindPWM_SMDMAE_CX0DE_Msk                 (0x1U << MindPWM_SMDMAE_CX0DE_Pos)                /*!<*/
#define  MindPWM_SMDMAE_CX0DE                     MindPWM_SMDMAE_CX0DE_Msk
#define  MindPWM_SMDMAE_CX1DE_Pos                 (1)
#define  MindPWM_SMDMAE_CX1DE_Msk                 (0x1U << MindPWM_SMDMAE_CX1DE_Pos)                /*!<*/
#define  MindPWM_SMDMAE_CX1DE                     MindPWM_SMDMAE_CX1DE_Msk
#define  MindPWM_SMDMAE_CA0DE_Pos                 (2)
#define  MindPWM_SMDMAE_CA0DE_Msk                 (0x1U << MindPWM_SMDMAE_CA0DE_Pos)                /*!<*/
#define  MindPWM_SMDMAE_CA0DE                     MindPWM_SMDMAE_CA0DE_Msk
#define  MindPWM_SMDMAE_CA1DE_Pos                 (3)
#define  MindPWM_SMDMAE_CA1DE_Msk                 (0x1U << MindPWM_SMDMAE_CA1DE_Pos)                /*!<*/
#define  MindPWM_SMDMAE_CA1DE                     MindPWM_SMDMAE_CA1DE_Msk
#define  MindPWM_SMDMAE_CB0DE_Pos                 (4)
#define  MindPWM_SMDMAE_CB0DE_Msk                 (0x1U << MindPWM_SMDMAE_CB0DE_Pos)                /*!<*/
#define  MindPWM_SMDMAE_CB0DE                     MindPWM_SMDMAE_CB0DE_Msk
#define  MindPWM_SMDMAE_CB1DE_Pos                 (5)
#define  MindPWM_SMDMAE_CB1DE_Msk                 (0x1U << MindPWM_SMDMAE_CB1DE_Pos)                /*!<*/
#define  MindPWM_SMDMAE_CB1DE                     MindPWM_SMDMAE_CB1DE_Msk
#define  MindPWM_SMDMAE_CAPTDE_Pos                (6)
#define  MindPWM_SMDMAE_CAPTDE_Msk                (0x3U << MindPWM_SMDMAE_CAPTDE_Pos)               /*!<*/
#define  MindPWM_SMDMAE_CAPTDE                    MindPWM_SMDMAE_CAPTDE_Msk
#define  MindPWM_SMDMAE_CAPTDE_Bit0               (0x1U << MindPWM_SMDMAE_CAPTDE_Pos) 
#define  MindPWM_SMDMAE_CAPTDE_Bit1               (0x2U << MindPWM_SMDMAE_CAPTDE_Pos) 
#define  MindPWM_SMDMAE_FAND_Pos                  (8)
#define  MindPWM_SMDMAE_FAND_Msk                  (0x1U << MindPWM_SMDMAE_FAND_Pos)                 /*!<*/
#define  MindPWM_SMDMAE_FAND                      MindPWM_SMDMAE_FAND_Msk
#define  MindPWM_SMDMAE_VALDE_Pos                 (9)
#define  MindPWM_SMDMAE_VALDE_Msk                 (0x1U << MindPWM_SMDMAE_VALDE_Pos)                /*!<*/
#define  MindPWM_SMDMAE_VALDE                     MindPWM_SMDMAE_VALDE_Msk

/**
  * @brief MindPWM_SMTRGCR Register Bit Definition
  */
#define  MindPWM_SMTRGCR_OUT_TRIG_EN_Pos          (0)
#define  MindPWM_SMTRGCR_OUT_TRIG_EN_Msk          (0x3FU << MindPWM_SMTRGCR_OUT_TRIG_EN_Pos)        /*!<*/
#define  MindPWM_SMTRGCR_OUT_TRIG_EN              MindPWM_SMTRGCR_OUT_TRIG_EN_Msk
#define  MindPWM_SMTRGCR_OUT_TRIG_EN_Bit0         (0x01U << MindPWM_SMTRGCR_OUT_TRIG_EN_Pos) 
#define  MindPWM_SMTRGCR_OUT_TRIG_EN_Bit1         (0x02U << MindPWM_SMTRGCR_OUT_TRIG_EN_Pos) 
#define  MindPWM_SMTRGCR_OUT_TRIG_EN_Bit2         (0x04U << MindPWM_SMTRGCR_OUT_TRIG_EN_Pos) 
#define  MindPWM_SMTRGCR_OUT_TRIG_EN_Bit3         (0x08U << MindPWM_SMTRGCR_OUT_TRIG_EN_Pos) 
#define  MindPWM_SMTRGCR_OUT_TRIG_EN_Bit4         (0x10U << MindPWM_SMTRGCR_OUT_TRIG_EN_Pos) 
#define  MindPWM_SMTRGCR_OUT_TRIG_EN_Bit5         (0x20U << MindPWM_SMTRGCR_OUT_TRIG_EN_Pos) 
#define  MindPWM_SMTRGCR_TRGFRQ_Pos               (8)
#define  MindPWM_SMTRGCR_TRGFRQ_Msk               (0x1U << MindPWM_SMTRGCR_TRGFRQ_Pos)              /*!<*/
#define  MindPWM_SMTRGCR_TRGFRQ                   MindPWM_SMTRGCR_TRGFRQ_Msk
#define  MindPWM_SMTRGCR_OT0_SEL_Pos              (10)
#define  MindPWM_SMTRGCR_OT0_SEL_Msk              (0x3U << MindPWM_SMTRGCR_OT0_SEL_Pos)             /*!<*/
#define  MindPWM_SMTRGCR_OT0_SEL                  MindPWM_SMTRGCR_OT0_SEL_Msk
#define  MindPWM_SMTRGCR_OT0_SEL_Bit0             (0x1U << MindPWM_SMTRGCR_OT0_SEL_Pos) 
#define  MindPWM_SMTRGCR_OT0_SEL_Bit1             (0x2U << MindPWM_SMTRGCR_OT0_SEL_Pos) 
#define  MindPWM_SMTRGCR_OT1_SEL_Pos              (13)
#define  MindPWM_SMTRGCR_OT1_SEL_Msk              (0x3U << MindPWM_SMTRGCR_OT1_SEL_Pos)             /*!<*/
#define  MindPWM_SMTRGCR_OT1_SEL                  MindPWM_SMTRGCR_OT1_SEL_Msk
#define  MindPWM_SMTRGCR_OT1_SEL_Bit0             (0x1U << MindPWM_SMTRGCR_OT1_SEL_Pos) 
#define  MindPWM_SMTRGCR_OT1_SEL_Bit1             (0x2U << MindPWM_SMTRGCR_OT1_SEL_Pos) 

/**
  * @brief MindPWM_SMFDIS0 Register Bit Definition
  */
#define  MindPWM_SMFDIS0_FDISX0_Pos               (0)
#define  MindPWM_SMFDIS0_FDISX0_Msk               (0xFU << MindPWM_SMFDIS0_FDISX0_Pos)              /*!<*/
#define  MindPWM_SMFDIS0_FDISX0                   MindPWM_SMFDIS0_FDISX0_Msk
#define  MindPWM_SMFDIS0_FDISX0_Bit0              (0x1U << MindPWM_SMFDIS0_FDISX0_Pos) 
#define  MindPWM_SMFDIS0_FDISX0_Bit1              (0x2U << MindPWM_SMFDIS0_FDISX0_Pos) 
#define  MindPWM_SMFDIS0_FDISX0_Bit2              (0x4U << MindPWM_SMFDIS0_FDISX0_Pos) 
#define  MindPWM_SMFDIS0_FDISX0_Bit3              (0x8U << MindPWM_SMFDIS0_FDISX0_Pos) 
#define  MindPWM_SMFDIS0_FDISA0_Pos               (4)
#define  MindPWM_SMFDIS0_FDISA0_Msk               (0xFU << MindPWM_SMFDIS0_FDISA0_Pos)              /*!<*/
#define  MindPWM_SMFDIS0_FDISA0                   MindPWM_SMFDIS0_FDISA0_Msk
#define  MindPWM_SMFDIS0_FDISA0_Bit0              (0x1U << MindPWM_SMFDIS0_FDISA0_Pos) 
#define  MindPWM_SMFDIS0_FDISA0_Bit1              (0x2U << MindPWM_SMFDIS0_FDISA0_Pos) 
#define  MindPWM_SMFDIS0_FDISA0_Bit2              (0x4U << MindPWM_SMFDIS0_FDISA0_Pos) 
#define  MindPWM_SMFDIS0_FDISA0_Bit3              (0x8U << MindPWM_SMFDIS0_FDISA0_Pos) 
#define  MindPWM_SMFDIS0_FDISB0_Pos               (8)
#define  MindPWM_SMFDIS0_FDISB0_Msk               (0xFU << MindPWM_SMFDIS0_FDISB0_Pos)              /*!<*/
#define  MindPWM_SMFDIS0_FDISB0                   MindPWM_SMFDIS0_FDISB0_Msk
#define  MindPWM_SMFDIS0_FDISB0_Bit0              (0x1U << MindPWM_SMFDIS0_FDISB0_Pos) 
#define  MindPWM_SMFDIS0_FDISB0_Bit1              (0x2U << MindPWM_SMFDIS0_FDISB0_Pos) 
#define  MindPWM_SMFDIS0_FDISB0_Bit2              (0x4U << MindPWM_SMFDIS0_FDISB0_Pos) 
#define  MindPWM_SMFDIS0_FDISB0_Bit3              (0x8U << MindPWM_SMFDIS0_FDISB0_Pos) 
#define  MindPWM_SMFDIS0_FDISX1_Pos               (16)
#define  MindPWM_SMFDIS0_FDISX1_Msk               (0xFU << MindPWM_SMFDIS0_FDISX1_Pos)              /*!<*/
#define  MindPWM_SMFDIS0_FDISX1                   MindPWM_SMFDIS0_FDISX1_Msk
#define  MindPWM_SMFDIS0_FDISX1_Bit0              (0x1U << MindPWM_SMFDIS0_FDISX1_Pos) 
#define  MindPWM_SMFDIS0_FDISX1_Bit1              (0x2U << MindPWM_SMFDIS0_FDISX1_Pos) 
#define  MindPWM_SMFDIS0_FDISX1_Bit2              (0x4U << MindPWM_SMFDIS0_FDISX1_Pos) 
#define  MindPWM_SMFDIS0_FDISX1_Bit3              (0x8U << MindPWM_SMFDIS0_FDISX1_Pos) 
#define  MindPWM_SMFDIS0_FDISA1_Pos               (20)
#define  MindPWM_SMFDIS0_FDISA1_Msk               (0xFU << MindPWM_SMFDIS0_FDISA1_Pos)              /*!<*/
#define  MindPWM_SMFDIS0_FDISA1                   MindPWM_SMFDIS0_FDISA1_Msk
#define  MindPWM_SMFDIS0_FDISA1_Bit0              (0x1U << MindPWM_SMFDIS0_FDISA1_Pos) 
#define  MindPWM_SMFDIS0_FDISA1_Bit1              (0x2U << MindPWM_SMFDIS0_FDISA1_Pos) 
#define  MindPWM_SMFDIS0_FDISA1_Bit2              (0x4U << MindPWM_SMFDIS0_FDISA1_Pos) 
#define  MindPWM_SMFDIS0_FDISA1_Bit3              (0x8U << MindPWM_SMFDIS0_FDISA1_Pos) 
#define  MindPWM_SMFDIS0_FDISB1_Pos               (24)
#define  MindPWM_SMFDIS0_FDISB1_Msk               (0xFU << MindPWM_SMFDIS0_FDISB1_Pos)              /*!<*/
#define  MindPWM_SMFDIS0_FDISB1                   MindPWM_SMFDIS0_FDISB1_Msk
#define  MindPWM_SMFDIS0_FDISB1_Bit0              (0x1U << MindPWM_SMFDIS0_FDISB1_Pos) 
#define  MindPWM_SMFDIS0_FDISB1_Bit1              (0x2U << MindPWM_SMFDIS0_FDISB1_Pos) 
#define  MindPWM_SMFDIS0_FDISB1_Bit2              (0x4U << MindPWM_SMFDIS0_FDISB1_Pos) 
#define  MindPWM_SMFDIS0_FDISB1_Bit3              (0x8U << MindPWM_SMFDIS0_FDISB1_Pos) 

/**
  * @brief MindPWM_SMFDIS1 Register Bit Definition
  */
#define  MindPWM_SMFDIS1_FDISX2_Pos               (0)
#define  MindPWM_SMFDIS1_FDISX2_Msk               (0xFU << MindPWM_SMFDIS1_FDISX2_Pos)              /*!<*/
#define  MindPWM_SMFDIS1_FDISX2                   MindPWM_SMFDIS1_FDISX2_Msk
#define  MindPWM_SMFDIS1_FDISX2_Bit0              (0x1U << MindPWM_SMFDIS1_FDISX2_Pos) 
#define  MindPWM_SMFDIS1_FDISX2_Bit1              (0x2U << MindPWM_SMFDIS1_FDISX2_Pos) 
#define  MindPWM_SMFDIS1_FDISX2_Bit2              (0x4U << MindPWM_SMFDIS1_FDISX2_Pos) 
#define  MindPWM_SMFDIS1_FDISX2_Bit3              (0x8U << MindPWM_SMFDIS1_FDISX2_Pos) 
#define  MindPWM_SMFDIS1_FDISA2_Pos               (4)
#define  MindPWM_SMFDIS1_FDISA2_Msk               (0xFU << MindPWM_SMFDIS1_FDISA2_Pos)              /*!<*/
#define  MindPWM_SMFDIS1_FDISA2                   MindPWM_SMFDIS1_FDISA2_Msk
#define  MindPWM_SMFDIS1_FDISA2_Bit0              (0x1U << MindPWM_SMFDIS1_FDISA2_Pos) 
#define  MindPWM_SMFDIS1_FDISA2_Bit1              (0x2U << MindPWM_SMFDIS1_FDISA2_Pos) 
#define  MindPWM_SMFDIS1_FDISA2_Bit2              (0x4U << MindPWM_SMFDIS1_FDISA2_Pos) 
#define  MindPWM_SMFDIS1_FDISA2_Bit3              (0x8U << MindPWM_SMFDIS1_FDISA2_Pos) 
#define  MindPWM_SMFDIS1_FDISB2_Pos               (8)
#define  MindPWM_SMFDIS1_FDISB2_Msk               (0xFU << MindPWM_SMFDIS1_FDISB2_Pos)              /*!<*/
#define  MindPWM_SMFDIS1_FDISB2                   MindPWM_SMFDIS1_FDISB2_Msk
#define  MindPWM_SMFDIS1_FDISB2_Bit0              (0x1U << MindPWM_SMFDIS1_FDISB2_Pos) 
#define  MindPWM_SMFDIS1_FDISB2_Bit1              (0x2U << MindPWM_SMFDIS1_FDISB2_Pos) 
#define  MindPWM_SMFDIS1_FDISB2_Bit2              (0x4U << MindPWM_SMFDIS1_FDISB2_Pos) 
#define  MindPWM_SMFDIS1_FDISB2_Bit3              (0x8U << MindPWM_SMFDIS1_FDISB2_Pos) 
#define  MindPWM_SMFDIS1_FDISX3_Pos               (16)
#define  MindPWM_SMFDIS1_FDISX3_Msk               (0xFU << MindPWM_SMFDIS1_FDISX3_Pos)              /*!<*/
#define  MindPWM_SMFDIS1_FDISX3                   MindPWM_SMFDIS1_FDISX3_Msk
#define  MindPWM_SMFDIS1_FDISX3_Bit0              (0x1U << MindPWM_SMFDIS1_FDISX3_Pos) 
#define  MindPWM_SMFDIS1_FDISX3_Bit1              (0x2U << MindPWM_SMFDIS1_FDISX3_Pos) 
#define  MindPWM_SMFDIS1_FDISX3_Bit2              (0x4U << MindPWM_SMFDIS1_FDISX3_Pos) 
#define  MindPWM_SMFDIS1_FDISX3_Bit3              (0x8U << MindPWM_SMFDIS1_FDISX3_Pos) 
#define  MindPWM_SMFDIS1_FDISA3_Pos               (20)
#define  MindPWM_SMFDIS1_FDISA3_Msk               (0xFU << MindPWM_SMFDIS1_FDISA3_Pos)              /*!<*/
#define  MindPWM_SMFDIS1_FDISA3                   MindPWM_SMFDIS1_FDISA3_Msk
#define  MindPWM_SMFDIS1_FDISA3_Bit0              (0x1U << MindPWM_SMFDIS1_FDISA3_Pos) 
#define  MindPWM_SMFDIS1_FDISA3_Bit1              (0x2U << MindPWM_SMFDIS1_FDISA3_Pos) 
#define  MindPWM_SMFDIS1_FDISA3_Bit2              (0x4U << MindPWM_SMFDIS1_FDISA3_Pos) 
#define  MindPWM_SMFDIS1_FDISA3_Bit3              (0x8U << MindPWM_SMFDIS1_FDISA3_Pos) 
#define  MindPWM_SMFDIS1_FDISB3_Pos               (24)
#define  MindPWM_SMFDIS1_FDISB3_Msk               (0xFU << MindPWM_SMFDIS1_FDISB3_Pos)              /*!<*/
#define  MindPWM_SMFDIS1_FDISB3                   MindPWM_SMFDIS1_FDISB3_Msk
#define  MindPWM_SMFDIS1_FDISB3_Bit0              (0x1U << MindPWM_SMFDIS1_FDISB3_Pos) 
#define  MindPWM_SMFDIS1_FDISB3_Bit1              (0x2U << MindPWM_SMFDIS1_FDISB3_Pos) 
#define  MindPWM_SMFDIS1_FDISB3_Bit2              (0x4U << MindPWM_SMFDIS1_FDISB3_Pos) 
#define  MindPWM_SMFDIS1_FDISB3_Bit3              (0x8U << MindPWM_SMFDIS1_FDISB3_Pos) 

/**
  * @brief MindPWM_SMDTCNT Register Bit Definition
  */
#define  MindPWM_SMDTCNT_DTCNTA_Pos               (0)
#define  MindPWM_SMDTCNT_DTCNTA_Msk               (0xFFFFU << MindPWM_SMDTCNT_DTCNTA_Pos)           /*!<*/
#define  MindPWM_SMDTCNT_DTCNTA                   MindPWM_SMDTCNT_DTCNTA_Msk
#define  MindPWM_SMDTCNT_DTCNTA_Bit0              (0x0001U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit1              (0x0002U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit2              (0x0004U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit3              (0x0008U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit4              (0x0010U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit5              (0x0020U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit6              (0x0040U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit7              (0x0080U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit8              (0x0100U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit9              (0x0200U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit10             (0x0400U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit11             (0x0800U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit12             (0x1000U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit13             (0x2000U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit14             (0x4000U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTA_Bit15             (0x8000U << MindPWM_SMDTCNT_DTCNTA_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Pos               (16)
#define  MindPWM_SMDTCNT_DTCNTB_Msk               (0xFFFFU << MindPWM_SMDTCNT_DTCNTB_Pos)           /*!<*/
#define  MindPWM_SMDTCNT_DTCNTB                   MindPWM_SMDTCNT_DTCNTB_Msk
#define  MindPWM_SMDTCNT_DTCNTB_Bit0              (0x0001U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit1              (0x0002U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit2              (0x0004U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit3              (0x0008U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit4              (0x0010U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit5              (0x0020U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit6              (0x0040U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit7              (0x0080U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit8              (0x0100U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit9              (0x0200U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit10             (0x0400U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit11             (0x0800U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit12             (0x1000U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit13             (0x2000U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit14             (0x4000U << MindPWM_SMDTCNT_DTCNTB_Pos) 
#define  MindPWM_SMDTCNT_DTCNTB_Bit15             (0x8000U << MindPWM_SMDTCNT_DTCNTB_Pos) 

/**
  * @brief MindPWM_SMCAPTCRX Register Bit Definition
  */
#define  MindPWM_SMCAPTCRX_ARMX_Pos               (0)
#define  MindPWM_SMCAPTCRX_ARMX_Msk               (0x1U << MindPWM_SMCAPTCRX_ARMX_Pos)              /*!<*/
#define  MindPWM_SMCAPTCRX_ARMX                   MindPWM_SMCAPTCRX_ARMX_Msk
#define  MindPWM_SMCAPTCRX_ONESHOTX_Pos           (1)
#define  MindPWM_SMCAPTCRX_ONESHOTX_Msk           (0x1U << MindPWM_SMCAPTCRX_ONESHOTX_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRX_ONESHOTX               MindPWM_SMCAPTCRX_ONESHOTX_Msk
#define  MindPWM_SMCAPTCRX_EDGX0_Pos              (2)
#define  MindPWM_SMCAPTCRX_EDGX0_Msk              (0x3U << MindPWM_SMCAPTCRX_EDGX0_Pos)             /*!<*/
#define  MindPWM_SMCAPTCRX_EDGX0                  MindPWM_SMCAPTCRX_EDGX0_Msk
#define  MindPWM_SMCAPTCRX_EDGX0_Bit0             (0x1U << MindPWM_SMCAPTCRX_EDGX0_Pos) 
#define  MindPWM_SMCAPTCRX_EDGX0_Bit1             (0x2U << MindPWM_SMCAPTCRX_EDGX0_Pos) 
#define  MindPWM_SMCAPTCRX_EDGX1_Pos              (4)
#define  MindPWM_SMCAPTCRX_EDGX1_Msk              (0x3U << MindPWM_SMCAPTCRX_EDGX1_Pos)             /*!<*/
#define  MindPWM_SMCAPTCRX_EDGX1                  MindPWM_SMCAPTCRX_EDGX1_Msk
#define  MindPWM_SMCAPTCRX_EDGX1_Bit0             (0x1U << MindPWM_SMCAPTCRX_EDGX1_Pos) 
#define  MindPWM_SMCAPTCRX_EDGX1_Bit1             (0x2U << MindPWM_SMCAPTCRX_EDGX1_Pos) 
#define  MindPWM_SMCAPTCRX_INP_SELX_Pos           (6)
#define  MindPWM_SMCAPTCRX_INP_SELX_Msk           (0x1U << MindPWM_SMCAPTCRX_INP_SELX_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRX_INP_SELX               MindPWM_SMCAPTCRX_INP_SELX_Msk
#define  MindPWM_SMCAPTCRX_EDGCNTX_EN_Pos         (7)
#define  MindPWM_SMCAPTCRX_EDGCNTX_EN_Msk         (0x1U << MindPWM_SMCAPTCRX_EDGCNTX_EN_Pos)        /*!<*/
#define  MindPWM_SMCAPTCRX_EDGCNTX_EN             MindPWM_SMCAPTCRX_EDGCNTX_EN_Msk
#define  MindPWM_SMCAPTCRX_CFXWM_Pos              (8)
#define  MindPWM_SMCAPTCRX_CFXWM_Msk              (0x3U << MindPWM_SMCAPTCRX_CFXWM_Pos)             /*!<*/
#define  MindPWM_SMCAPTCRX_CFXWM                  MindPWM_SMCAPTCRX_CFXWM_Msk
#define  MindPWM_SMCAPTCRX_CFXWM_Bit0             (0x1U << MindPWM_SMCAPTCRX_CFXWM_Pos) 
#define  MindPWM_SMCAPTCRX_CFXWM_Bit1             (0x2U << MindPWM_SMCAPTCRX_CFXWM_Pos) 
#define  MindPWM_SMCAPTCRX_CX0CNT_Pos             (10)
#define  MindPWM_SMCAPTCRX_CX0CNT_Msk             (0x7U << MindPWM_SMCAPTCRX_CX0CNT_Pos)            /*!<*/
#define  MindPWM_SMCAPTCRX_CX0CNT                 MindPWM_SMCAPTCRX_CX0CNT_Msk
#define  MindPWM_SMCAPTCRX_CX0CNT_Bit0            (0x1U << MindPWM_SMCAPTCRX_CX0CNT_Pos) 
#define  MindPWM_SMCAPTCRX_CX0CNT_Bit1            (0x2U << MindPWM_SMCAPTCRX_CX0CNT_Pos) 
#define  MindPWM_SMCAPTCRX_CX0CNT_Bit2            (0x4U << MindPWM_SMCAPTCRX_CX0CNT_Pos) 
#define  MindPWM_SMCAPTCRX_CX1CNT_Pos             (13)
#define  MindPWM_SMCAPTCRX_CX1CNT_Msk             (0x7U << MindPWM_SMCAPTCRX_CX1CNT_Pos)            /*!<*/
#define  MindPWM_SMCAPTCRX_CX1CNT                 MindPWM_SMCAPTCRX_CX1CNT_Msk
#define  MindPWM_SMCAPTCRX_CX1CNT_Bit0            (0x1U << MindPWM_SMCAPTCRX_CX1CNT_Pos) 
#define  MindPWM_SMCAPTCRX_CX1CNT_Bit1            (0x2U << MindPWM_SMCAPTCRX_CX1CNT_Pos) 
#define  MindPWM_SMCAPTCRX_CX1CNT_Bit2            (0x4U << MindPWM_SMCAPTCRX_CX1CNT_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCMPX_Pos            (16)
#define  MindPWM_SMCAPTCRX_EDGCMPX_Msk            (0xFFU << MindPWM_SMCAPTCRX_EDGCMPX_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRX_EDGCMPX                MindPWM_SMCAPTCRX_EDGCMPX_Msk
#define  MindPWM_SMCAPTCRX_EDGCMPX_Bit0           (0x01U << MindPWM_SMCAPTCRX_EDGCMPX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCMPX_Bit1           (0x02U << MindPWM_SMCAPTCRX_EDGCMPX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCMPX_Bit2           (0x04U << MindPWM_SMCAPTCRX_EDGCMPX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCMPX_Bit3           (0x08U << MindPWM_SMCAPTCRX_EDGCMPX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCMPX_Bit4           (0x10U << MindPWM_SMCAPTCRX_EDGCMPX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCMPX_Bit5           (0x20U << MindPWM_SMCAPTCRX_EDGCMPX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCMPX_Bit6           (0x40U << MindPWM_SMCAPTCRX_EDGCMPX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCMPX_Bit7           (0x80U << MindPWM_SMCAPTCRX_EDGCMPX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCNTX_Pos            (24)
#define  MindPWM_SMCAPTCRX_EDGCNTX_Msk            (0xFFU << MindPWM_SMCAPTCRX_EDGCNTX_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRX_EDGCNTX                MindPWM_SMCAPTCRX_EDGCNTX_Msk
#define  MindPWM_SMCAPTCRX_EDGCNTX_Bit0           (0x01U << MindPWM_SMCAPTCRX_EDGCNTX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCNTX_Bit1           (0x02U << MindPWM_SMCAPTCRX_EDGCNTX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCNTX_Bit2           (0x04U << MindPWM_SMCAPTCRX_EDGCNTX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCNTX_Bit3           (0x08U << MindPWM_SMCAPTCRX_EDGCNTX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCNTX_Bit4           (0x10U << MindPWM_SMCAPTCRX_EDGCNTX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCNTX_Bit5           (0x20U << MindPWM_SMCAPTCRX_EDGCNTX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCNTX_Bit6           (0x40U << MindPWM_SMCAPTCRX_EDGCNTX_Pos) 
#define  MindPWM_SMCAPTCRX_EDGCNTX_Bit7           (0x80U << MindPWM_SMCAPTCRX_EDGCNTX_Pos) 

