SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_mindpwm.h
/**
  * @brief MindPWM_SMCAPTCRA Register Bit Definition
  */
#define  MindPWM_SMCAPTCRA_ARMA_Pos               (0)
#define  MindPWM_SMCAPTCRA_ARMA_Msk               (0x1U << MindPWM_SMCAPTCRA_ARMA_Pos)              /*!<*/
#define  MindPWM_SMCAPTCRA_ARMA                   MindPWM_SMCAPTCRA_ARMA_Msk
#define  MindPWM_SMCAPTCRA_ONESHOTA_Pos           (1)
#define  MindPWM_SMCAPTCRA_ONESHOTA_Msk           (0x1U << MindPWM_SMCAPTCRA_ONESHOTA_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRA_ONESHOTA               MindPWM_SMCAPTCRA_ONESHOTA_Msk
#define  MindPWM_SMCAPTCRA_EDGA0_Pos              (2)
#define  MindPWM_SMCAPTCRA_EDGA0_Msk              (0x3U << MindPWM_SMCAPTCRA_EDGA0_Pos)             /*!<*/
#define  MindPWM_SMCAPTCRA_EDGA0                  MindPWM_SMCAPTCRA_EDGA0_Msk
#define  MindPWM_SMCAPTCRA_EDGA0_Bit0             (0x1U << MindPWM_SMCAPTCRA_EDGA0_Pos) 
#define  MindPWM_SMCAPTCRA_EDGA0_Bit1             (0x2U << MindPWM_SMCAPTCRA_EDGA0_Pos) 
#define  MindPWM_SMCAPTCRA_EDGA1_Pos              (4)
#define  MindPWM_SMCAPTCRA_EDGA1_Msk              (0x3U << MindPWM_SMCAPTCRA_EDGA1_Pos)             /*!<*/
#define  MindPWM_SMCAPTCRA_EDGA1                  MindPWM_SMCAPTCRA_EDGA1_Msk
#define  MindPWM_SMCAPTCRA_EDGA1_Bit0             (0x1U << MindPWM_SMCAPTCRA_EDGA1_Pos) 
#define  MindPWM_SMCAPTCRA_EDGA1_Bit1             (0x2U << MindPWM_SMCAPTCRA_EDGA1_Pos) 
#define  MindPWM_SMCAPTCRA_INP_SELA_Pos           (6)
#define  MindPWM_SMCAPTCRA_INP_SELA_Msk           (0x1U << MindPWM_SMCAPTCRA_INP_SELA_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRA_INP_SELA               MindPWM_SMCAPTCRA_INP_SELA_Msk
#define  MindPWM_SMCAPTCRA_EDGCNTA_EN_Pos         (7)
#define  MindPWM_SMCAPTCRA_EDGCNTA_EN_Msk         (0x1U << MindPWM_SMCAPTCRA_EDGCNTA_EN_Pos)        /*!<*/
#define  MindPWM_SMCAPTCRA_EDGCNTA_EN             MindPWM_SMCAPTCRA_EDGCNTA_EN_Msk
#define  MindPWM_SMCAPTCRA_CFAWM_Pos              (8)
#define  MindPWM_SMCAPTCRA_CFAWM_Msk              (0x3U << MindPWM_SMCAPTCRA_CFAWM_Pos)             /*!<*/
#define  MindPWM_SMCAPTCRA_CFAWM                  MindPWM_SMCAPTCRA_CFAWM_Msk
#define  MindPWM_SMCAPTCRA_CFAWM_Bit0             (0x1U << MindPWM_SMCAPTCRA_CFAWM_Pos) 
#define  MindPWM_SMCAPTCRA_CFAWM_Bit1             (0x2U << MindPWM_SMCAPTCRA_CFAWM_Pos) 
#define  MindPWM_SMCAPTCRA_CA0CNT_Pos             (10)
#define  MindPWM_SMCAPTCRA_CA0CNT_Msk             (0x7U << MindPWM_SMCAPTCRA_CA0CNT_Pos)            /*!<*/
#define  MindPWM_SMCAPTCRA_CA0CNT                 MindPWM_SMCAPTCRA_CA0CNT_Msk
#define  MindPWM_SMCAPTCRA_CA0CNT_Bit0            (0x1U << MindPWM_SMCAPTCRA_CA0CNT_Pos) 
#define  MindPWM_SMCAPTCRA_CA0CNT_Bit1            (0x2U << MindPWM_SMCAPTCRA_CA0CNT_Pos) 
#define  MindPWM_SMCAPTCRA_CA0CNT_Bit2            (0x4U << MindPWM_SMCAPTCRA_CA0CNT_Pos) 
#define  MindPWM_SMCAPTCRA_CA1CNT_Pos             (13)
#define  MindPWM_SMCAPTCRA_CA1CNT_Msk             (0x7U << MindPWM_SMCAPTCRA_CA1CNT_Pos)            /*!<*/
#define  MindPWM_SMCAPTCRA_CA1CNT                 MindPWM_SMCAPTCRA_CA1CNT_Msk
#define  MindPWM_SMCAPTCRA_CA1CNT_Bit0            (0x1U << MindPWM_SMCAPTCRA_CA1CNT_Pos) 
#define  MindPWM_SMCAPTCRA_CA1CNT_Bit1            (0x2U << MindPWM_SMCAPTCRA_CA1CNT_Pos) 
#define  MindPWM_SMCAPTCRA_CA1CNT_Bit2            (0x4U << MindPWM_SMCAPTCRA_CA1CNT_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCMPA_Pos            (16)
#define  MindPWM_SMCAPTCRA_EDGCMPA_Msk            (0xFFU << MindPWM_SMCAPTCRA_EDGCMPA_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRA_EDGCMPA                MindPWM_SMCAPTCRA_EDGCMPA_Msk
#define  MindPWM_SMCAPTCRA_EDGCMPA_Bit0           (0x01U << MindPWM_SMCAPTCRA_EDGCMPA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCMPA_Bit1           (0x02U << MindPWM_SMCAPTCRA_EDGCMPA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCMPA_Bit2           (0x04U << MindPWM_SMCAPTCRA_EDGCMPA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCMPA_Bit3           (0x08U << MindPWM_SMCAPTCRA_EDGCMPA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCMPA_Bit4           (0x10U << MindPWM_SMCAPTCRA_EDGCMPA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCMPA_Bit5           (0x20U << MindPWM_SMCAPTCRA_EDGCMPA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCMPA_Bit6           (0x40U << MindPWM_SMCAPTCRA_EDGCMPA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCMPA_Bit7           (0x80U << MindPWM_SMCAPTCRA_EDGCMPA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCNTA_Pos            (24)
#define  MindPWM_SMCAPTCRA_EDGCNTA_Msk            (0xFFU << MindPWM_SMCAPTCRA_EDGCNTA_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRA_EDGCNTA                MindPWM_SMCAPTCRA_EDGCNTA_Msk
#define  MindPWM_SMCAPTCRA_EDGCNTA_Bit0           (0x01U << MindPWM_SMCAPTCRA_EDGCNTA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCNTA_Bit1           (0x02U << MindPWM_SMCAPTCRA_EDGCNTA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCNTA_Bit2           (0x04U << MindPWM_SMCAPTCRA_EDGCNTA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCNTA_Bit3           (0x08U << MindPWM_SMCAPTCRA_EDGCNTA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCNTA_Bit4           (0x10U << MindPWM_SMCAPTCRA_EDGCNTA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCNTA_Bit5           (0x20U << MindPWM_SMCAPTCRA_EDGCNTA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCNTA_Bit6           (0x40U << MindPWM_SMCAPTCRA_EDGCNTA_Pos) 
#define  MindPWM_SMCAPTCRA_EDGCNTA_Bit7           (0x80U << MindPWM_SMCAPTCRA_EDGCNTA_Pos) 

/**
  * @brief MindPWM_SMCAPTCRB Register Bit Definition
  */
#define  MindPWM_SMCAPTCRB_ARMB_Pos               (0)
#define  MindPWM_SMCAPTCRB_ARMB_Msk               (0x1U << MindPWM_SMCAPTCRB_ARMB_Pos)              /*!<*/
#define  MindPWM_SMCAPTCRB_ARMB                   MindPWM_SMCAPTCRB_ARMB_Msk
#define  MindPWM_SMCAPTCRB_ONESHOTB_Pos           (1)
#define  MindPWM_SMCAPTCRB_ONESHOTB_Msk           (0x1U << MindPWM_SMCAPTCRB_ONESHOTB_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRB_ONESHOTB               MindPWM_SMCAPTCRB_ONESHOTB_Msk
#define  MindPWM_SMCAPTCRB_EDGB0_Pos              (2)
#define  MindPWM_SMCAPTCRB_EDGB0_Msk              (0x3U << MindPWM_SMCAPTCRB_EDGB0_Pos)             /*!<*/
#define  MindPWM_SMCAPTCRB_EDGB0                  MindPWM_SMCAPTCRB_EDGB0_Msk
#define  MindPWM_SMCAPTCRB_EDGB0_Bit0             (0x1U << MindPWM_SMCAPTCRB_EDGB0_Pos) 
#define  MindPWM_SMCAPTCRB_EDGB0_Bit1             (0x2U << MindPWM_SMCAPTCRB_EDGB0_Pos) 
#define  MindPWM_SMCAPTCRB_EDGB1_Pos              (4)
#define  MindPWM_SMCAPTCRB_EDGB1_Msk              (0x3U << MindPWM_SMCAPTCRB_EDGB1_Pos)             /*!<*/
#define  MindPWM_SMCAPTCRB_EDGB1                  MindPWM_SMCAPTCRB_EDGB1_Msk
#define  MindPWM_SMCAPTCRB_EDGB1_Bit0             (0x1U << MindPWM_SMCAPTCRB_EDGB1_Pos) 
#define  MindPWM_SMCAPTCRB_EDGB1_Bit1             (0x2U << MindPWM_SMCAPTCRB_EDGB1_Pos) 
#define  MindPWM_SMCAPTCRB_INP_SELB_Pos           (6)
#define  MindPWM_SMCAPTCRB_INP_SELB_Msk           (0x1U << MindPWM_SMCAPTCRB_INP_SELB_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRB_INP_SELB               MindPWM_SMCAPTCRB_INP_SELB_Msk
#define  MindPWM_SMCAPTCRB_EDGCNTB_EN_Pos         (7)
#define  MindPWM_SMCAPTCRB_EDGCNTB_EN_Msk         (0x1U << MindPWM_SMCAPTCRB_EDGCNTB_EN_Pos)        /*!<*/
#define  MindPWM_SMCAPTCRB_EDGCNTB_EN             MindPWM_SMCAPTCRB_EDGCNTB_EN_Msk
#define  MindPWM_SMCAPTCRB_CFBWM_Pos              (8)
#define  MindPWM_SMCAPTCRB_CFBWM_Msk              (0x3U << MindPWM_SMCAPTCRB_CFBWM_Pos)             /*!<*/
#define  MindPWM_SMCAPTCRB_CFBWM                  MindPWM_SMCAPTCRB_CFBWM_Msk
#define  MindPWM_SMCAPTCRB_CFBWM_Bit0             (0x1U << MindPWM_SMCAPTCRB_CFBWM_Pos) 
#define  MindPWM_SMCAPTCRB_CFBWM_Bit1             (0x2U << MindPWM_SMCAPTCRB_CFBWM_Pos) 
#define  MindPWM_SMCAPTCRB_CB0CNT_Pos             (10)
#define  MindPWM_SMCAPTCRB_CB0CNT_Msk             (0x7U << MindPWM_SMCAPTCRB_CB0CNT_Pos)            /*!<*/
#define  MindPWM_SMCAPTCRB_CB0CNT                 MindPWM_SMCAPTCRB_CB0CNT_Msk
#define  MindPWM_SMCAPTCRB_CB0CNT_Bit0            (0x1U << MindPWM_SMCAPTCRB_CB0CNT_Pos) 
#define  MindPWM_SMCAPTCRB_CB0CNT_Bit1            (0x2U << MindPWM_SMCAPTCRB_CB0CNT_Pos) 
#define  MindPWM_SMCAPTCRB_CB0CNT_Bit2            (0x4U << MindPWM_SMCAPTCRB_CB0CNT_Pos) 
#define  MindPWM_SMCAPTCRB_CB1CNT_Pos             (13)
#define  MindPWM_SMCAPTCRB_CB1CNT_Msk             (0x7U << MindPWM_SMCAPTCRB_CB1CNT_Pos)            /*!<*/
#define  MindPWM_SMCAPTCRB_CB1CNT                 MindPWM_SMCAPTCRB_CB1CNT_Msk
#define  MindPWM_SMCAPTCRB_CB1CNT_Bit0            (0x1U << MindPWM_SMCAPTCRB_CB1CNT_Pos) 
#define  MindPWM_SMCAPTCRB_CB1CNT_Bit1            (0x2U << MindPWM_SMCAPTCRB_CB1CNT_Pos) 
#define  MindPWM_SMCAPTCRB_CB1CNT_Bit2            (0x4U << MindPWM_SMCAPTCRB_CB1CNT_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCMPB_Pos            (16)
#define  MindPWM_SMCAPTCRB_EDGCMPB_Msk            (0xFFU << MindPWM_SMCAPTCRB_EDGCMPB_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRB_EDGCMPB                MindPWM_SMCAPTCRB_EDGCMPB_Msk
#define  MindPWM_SMCAPTCRB_EDGCMPB_Bit0           (0x01U << MindPWM_SMCAPTCRB_EDGCMPB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCMPB_Bit1           (0x02U << MindPWM_SMCAPTCRB_EDGCMPB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCMPB_Bit2           (0x04U << MindPWM_SMCAPTCRB_EDGCMPB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCMPB_Bit3           (0x08U << MindPWM_SMCAPTCRB_EDGCMPB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCMPB_Bit4           (0x10U << MindPWM_SMCAPTCRB_EDGCMPB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCMPB_Bit5           (0x20U << MindPWM_SMCAPTCRB_EDGCMPB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCMPB_Bit6           (0x40U << MindPWM_SMCAPTCRB_EDGCMPB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCMPB_Bit7           (0x80U << MindPWM_SMCAPTCRB_EDGCMPB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCNTB_Pos            (24)
#define  MindPWM_SMCAPTCRB_EDGCNTB_Msk            (0xFFU << MindPWM_SMCAPTCRB_EDGCNTB_Pos)          /*!<*/
#define  MindPWM_SMCAPTCRB_EDGCNTB                MindPWM_SMCAPTCRB_EDGCNTB_Msk
#define  MindPWM_SMCAPTCRB_EDGCNTB_Bit0           (0x01U << MindPWM_SMCAPTCRB_EDGCNTB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCNTB_Bit1           (0x02U << MindPWM_SMCAPTCRB_EDGCNTB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCNTB_Bit2           (0x04U << MindPWM_SMCAPTCRB_EDGCNTB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCNTB_Bit3           (0x08U << MindPWM_SMCAPTCRB_EDGCNTB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCNTB_Bit4           (0x10U << MindPWM_SMCAPTCRB_EDGCNTB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCNTB_Bit5           (0x20U << MindPWM_SMCAPTCRB_EDGCNTB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCNTB_Bit6           (0x40U << MindPWM_SMCAPTCRB_EDGCNTB_Pos) 
#define  MindPWM_SMCAPTCRB_EDGCNTB_Bit7           (0x80U << MindPWM_SMCAPTCRB_EDGCNTB_Pos) 

/**
  * @brief MindPWM_SMCVAL0 Register Bit Definition
  */
#define  MindPWM_SMCVAL0_CAPTVAL0_Pos             (0)
#define  MindPWM_SMCVAL0_CAPTVAL0_Msk             (0xFFFFU << MindPWM_SMCVAL0_CAPTVAL0_Pos)         /*!<*/
#define  MindPWM_SMCVAL0_CAPTVAL0                 MindPWM_SMCVAL0_CAPTVAL0_Msk
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit0            (0x0001U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit1            (0x0002U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit2            (0x0004U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit3            (0x0008U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit4            (0x0010U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit5            (0x0020U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit6            (0x0040U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit7            (0x0080U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit8            (0x0100U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit9            (0x0200U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit10           (0x0400U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit11           (0x0800U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit12           (0x1000U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit13           (0x2000U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit14           (0x4000U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 
#define  MindPWM_SMCVAL0_CAPTVAL0_Bit15           (0x8000U << MindPWM_SMCVAL0_CAPTVAL0_Pos) 

/**
  * @brief MindPWM_SMCVAL1 Register Bit Definition
  */
#define  MindPWM_SMCVAL1_CAPTVAL1_Pos             (0)
#define  MindPWM_SMCVAL1_CAPTVAL1_Msk             (0xFFFFU << MindPWM_SMCVAL1_CAPTVAL1_Pos)         /*!<*/
#define  MindPWM_SMCVAL1_CAPTVAL1                 MindPWM_SMCVAL1_CAPTVAL1_Msk
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit0            (0x0001U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit1            (0x0002U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit2            (0x0004U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit3            (0x0008U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit4            (0x0010U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit5            (0x0020U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit6            (0x0040U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit7            (0x0080U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit8            (0x0100U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit9            (0x0200U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit10           (0x0400U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit11           (0x0800U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit12           (0x1000U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit13           (0x2000U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit14           (0x4000U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 
#define  MindPWM_SMCVAL1_CAPTVAL1_Bit15           (0x8000U << MindPWM_SMCVAL1_CAPTVAL1_Pos) 

/**
  * @brief MindPWM_SMCVAL2 Register Bit Definition
  */
#define  MindPWM_SMCVAL2_CAPTVAL2_Pos             (0)
#define  MindPWM_SMCVAL2_CAPTVAL2_Msk             (0xFFFFU << MindPWM_SMCVAL2_CAPTVAL2_Pos)         /*!<*/
#define  MindPWM_SMCVAL2_CAPTVAL2                 MindPWM_SMCVAL2_CAPTVAL2_Msk
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit0            (0x0001U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit1            (0x0002U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit2            (0x0004U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit3            (0x0008U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit4            (0x0010U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit5            (0x0020U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit6            (0x0040U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit7            (0x0080U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit8            (0x0100U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit9            (0x0200U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit10           (0x0400U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit11           (0x0800U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit12           (0x1000U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit13           (0x2000U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit14           (0x4000U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 
#define  MindPWM_SMCVAL2_CAPTVAL2_Bit15           (0x8000U << MindPWM_SMCVAL2_CAPTVAL2_Pos) 

/**
  * @brief MindPWM_SMCVAL3 Register Bit Definition
  */
#define  MindPWM_SMCVAL3_CAPTVAL3_Pos             (0)
#define  MindPWM_SMCVAL3_CAPTVAL3_Msk             (0xFFFFU << MindPWM_SMCVAL3_CAPTVAL3_Pos)         /*!<*/
#define  MindPWM_SMCVAL3_CAPTVAL3                 MindPWM_SMCVAL3_CAPTVAL3_Msk
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit0            (0x0001U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit1            (0x0002U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit2            (0x0004U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit3            (0x0008U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit4            (0x0010U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit5            (0x0020U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit6            (0x0040U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit7            (0x0080U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit8            (0x0100U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit9            (0x0200U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit10           (0x0400U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit11           (0x0800U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit12           (0x1000U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit13           (0x2000U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit14           (0x4000U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 
#define  MindPWM_SMCVAL3_CAPTVAL3_Bit15           (0x8000U << MindPWM_SMCVAL3_CAPTVAL3_Pos) 

/**
  * @brief MindPWM_SMCVAL4 Register Bit Definition
  */
#define  MindPWM_SMCVAL4_CAPTVAL4_Pos             (0)
#define  MindPWM_SMCVAL4_CAPTVAL4_Msk             (0xFFFFU << MindPWM_SMCVAL4_CAPTVAL4_Pos)         /*!<*/
#define  MindPWM_SMCVAL4_CAPTVAL4                 MindPWM_SMCVAL4_CAPTVAL4_Msk
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit0            (0x0001U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit1            (0x0002U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit2            (0x0004U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit3            (0x0008U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit4            (0x0010U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit5            (0x0020U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit6            (0x0040U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit7            (0x0080U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit8            (0x0100U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit9            (0x0200U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit10           (0x0400U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit11           (0x0800U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit12           (0x1000U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit13           (0x2000U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit14           (0x4000U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 
#define  MindPWM_SMCVAL4_CAPTVAL4_Bit15           (0x8000U << MindPWM_SMCVAL4_CAPTVAL4_Pos) 

/**
  * @brief MindPWM_SMCVAL5 Register Bit Definition
  */
#define  MindPWM_SMCVAL5_CAPTVAL5_Pos             (0)
#define  MindPWM_SMCVAL5_CAPTVAL5_Msk             (0xFFFFU << MindPWM_SMCVAL5_CAPTVAL5_Pos)         /*!<*/
#define  MindPWM_SMCVAL5_CAPTVAL5                 MindPWM_SMCVAL5_CAPTVAL5_Msk
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit0            (0x0001U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit1            (0x0002U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit2            (0x0004U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit3            (0x0008U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit4            (0x0010U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit5            (0x0020U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit6            (0x0040U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit7            (0x0080U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit8            (0x0100U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit9            (0x0200U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit10           (0x0400U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit11           (0x0800U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit12           (0x1000U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit13           (0x2000U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit14           (0x4000U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 
#define  MindPWM_SMCVAL5_CAPTVAL5_Bit15           (0x8000U << MindPWM_SMCVAL5_CAPTVAL5_Pos) 

/**
  * @brief MindPWM_SMCCYC0 Register Bit Definition
  */
#define  MindPWM_SMCCYC0_CVAL0CYC_Pos             (0)
#define  MindPWM_SMCCYC0_CVAL0CYC_Msk             (0xFU << MindPWM_SMCCYC0_CVAL0CYC_Pos)            /*!<*/
#define  MindPWM_SMCCYC0_CVAL0CYC                 MindPWM_SMCCYC0_CVAL0CYC_Msk
#define  MindPWM_SMCCYC0_CVAL0CYC_Bit0            (0x1U << MindPWM_SMCCYC0_CVAL0CYC_Pos) 
#define  MindPWM_SMCCYC0_CVAL0CYC_Bit1            (0x2U << MindPWM_SMCCYC0_CVAL0CYC_Pos) 
#define  MindPWM_SMCCYC0_CVAL0CYC_Bit2            (0x4U << MindPWM_SMCCYC0_CVAL0CYC_Pos) 
#define  MindPWM_SMCCYC0_CVAL0CYC_Bit3            (0x8U << MindPWM_SMCCYC0_CVAL0CYC_Pos) 
#define  MindPWM_SMCCYC0_CVAL1CYC_Pos             (16)
#define  MindPWM_SMCCYC0_CVAL1CYC_Msk             (0xFU << MindPWM_SMCCYC0_CVAL1CYC_Pos)            /*!<*/
#define  MindPWM_SMCCYC0_CVAL1CYC                 MindPWM_SMCCYC0_CVAL1CYC_Msk
#define  MindPWM_SMCCYC0_CVAL1CYC_Bit0            (0x1U << MindPWM_SMCCYC0_CVAL1CYC_Pos) 
#define  MindPWM_SMCCYC0_CVAL1CYC_Bit1            (0x2U << MindPWM_SMCCYC0_CVAL1CYC_Pos) 
#define  MindPWM_SMCCYC0_CVAL1CYC_Bit2            (0x4U << MindPWM_SMCCYC0_CVAL1CYC_Pos) 
#define  MindPWM_SMCCYC0_CVAL1CYC_Bit3            (0x8U << MindPWM_SMCCYC0_CVAL1CYC_Pos) 

/**
  * @brief MindPWM_SMCCYC1 Register Bit Definition
  */
#define  MindPWM_SMCCYC1_CVAL2CYC_Pos             (0)
#define  MindPWM_SMCCYC1_CVAL2CYC_Msk             (0xFU << MindPWM_SMCCYC1_CVAL2CYC_Pos)            /*!<*/
#define  MindPWM_SMCCYC1_CVAL2CYC                 MindPWM_SMCCYC1_CVAL2CYC_Msk
#define  MindPWM_SMCCYC1_CVAL2CYC_Bit0            (0x1U << MindPWM_SMCCYC1_CVAL2CYC_Pos) 
#define  MindPWM_SMCCYC1_CVAL2CYC_Bit1            (0x2U << MindPWM_SMCCYC1_CVAL2CYC_Pos) 
#define  MindPWM_SMCCYC1_CVAL2CYC_Bit2            (0x4U << MindPWM_SMCCYC1_CVAL2CYC_Pos) 
#define  MindPWM_SMCCYC1_CVAL2CYC_Bit3            (0x8U << MindPWM_SMCCYC1_CVAL2CYC_Pos) 
#define  MindPWM_SMCCYC1_CVAL3CYC_Pos             (16)
#define  MindPWM_SMCCYC1_CVAL3CYC_Msk             (0xFU << MindPWM_SMCCYC1_CVAL3CYC_Pos)            /*!<*/
#define  MindPWM_SMCCYC1_CVAL3CYC                 MindPWM_SMCCYC1_CVAL3CYC_Msk
#define  MindPWM_SMCCYC1_CVAL3CYC_Bit0            (0x1U << MindPWM_SMCCYC1_CVAL3CYC_Pos) 
#define  MindPWM_SMCCYC1_CVAL3CYC_Bit1            (0x2U << MindPWM_SMCCYC1_CVAL3CYC_Pos) 
#define  MindPWM_SMCCYC1_CVAL3CYC_Bit2            (0x4U << MindPWM_SMCCYC1_CVAL3CYC_Pos) 
#define  MindPWM_SMCCYC1_CVAL3CYC_Bit3            (0x8U << MindPWM_SMCCYC1_CVAL3CYC_Pos) 

