SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_mindpwm.h
/**
  * @brief MindPWM_SMCCYC2 Register Bit Definition
  */
#define  MindPWM_SMCCYC2_CVAL4CYC_Pos             (0)
#define  MindPWM_SMCCYC2_CVAL4CYC_Msk             (0xFU << MindPWM_SMCCYC2_CVAL4CYC_Pos)            /*!<*/
#define  MindPWM_SMCCYC2_CVAL4CYC                 MindPWM_SMCCYC2_CVAL4CYC_Msk
#define  MindPWM_SMCCYC2_CVAL4CYC_Bit0            (0x1U << MindPWM_SMCCYC2_CVAL4CYC_Pos) 
#define  MindPWM_SMCCYC2_CVAL4CYC_Bit1            (0x2U << MindPWM_SMCCYC2_CVAL4CYC_Pos) 
#define  MindPWM_SMCCYC2_CVAL4CYC_Bit2            (0x4U << MindPWM_SMCCYC2_CVAL4CYC_Pos) 
#define  MindPWM_SMCCYC2_CVAL4CYC_Bit3            (0x8U << MindPWM_SMCCYC2_CVAL4CYC_Pos) 
#define  MindPWM_SMCCYC2_CVAL5CYC_Pos             (16)
#define  MindPWM_SMCCYC2_CVAL5CYC_Msk             (0xFU << MindPWM_SMCCYC2_CVAL5CYC_Pos)            /*!<*/
#define  MindPWM_SMCCYC2_CVAL5CYC                 MindPWM_SMCCYC2_CVAL5CYC_Msk
#define  MindPWM_SMCCYC2_CVAL5CYC_Bit0            (0x1U << MindPWM_SMCCYC2_CVAL5CYC_Pos) 
#define  MindPWM_SMCCYC2_CVAL5CYC_Bit1            (0x2U << MindPWM_SMCCYC2_CVAL5CYC_Pos) 
#define  MindPWM_SMCCYC2_CVAL5CYC_Bit2            (0x4U << MindPWM_SMCCYC2_CVAL5CYC_Pos) 
#define  MindPWM_SMCCYC2_CVAL5CYC_Bit3            (0x8U << MindPWM_SMCCYC2_CVAL5CYC_Pos) 

/**
  * @brief MindPWM_GCR0 Register Bit Definition
  */
#define  MindPWM_GCR0_LDOK_Pos                    (0)
#define  MindPWM_GCR0_LDOK_Msk                    (0xFU << MindPWM_GCR0_LDOK_Pos)                   /*!<*/
#define  MindPWM_GCR0_LDOK                        MindPWM_GCR0_LDOK_Msk
#define  MindPWM_GCR0_LDOK_Bit0                   (0x1U << MindPWM_GCR0_LDOK_Pos) 
#define  MindPWM_GCR0_LDOK_Bit1                   (0x2U << MindPWM_GCR0_LDOK_Pos) 
#define  MindPWM_GCR0_LDOK_Bit2                   (0x4U << MindPWM_GCR0_LDOK_Pos) 
#define  MindPWM_GCR0_LDOK_Bit3                   (0x8U << MindPWM_GCR0_LDOK_Pos) 
#define  MindPWM_GCR0_CLDOK_Pos                   (4)
#define  MindPWM_GCR0_CLDOK_Msk                   (0xFU << MindPWM_GCR0_CLDOK_Pos)                  /*!<*/
#define  MindPWM_GCR0_CLDOK                       MindPWM_GCR0_CLDOK_Msk
#define  MindPWM_GCR0_CLDOK_Bit0                  (0x1U << MindPWM_GCR0_CLDOK_Pos) 
#define  MindPWM_GCR0_CLDOK_Bit1                  (0x2U << MindPWM_GCR0_CLDOK_Pos) 
#define  MindPWM_GCR0_CLDOK_Bit2                  (0x4U << MindPWM_GCR0_CLDOK_Pos) 
#define  MindPWM_GCR0_CLDOK_Bit3                  (0x8U << MindPWM_GCR0_CLDOK_Pos) 
#define  MindPWM_GCR0_RUN_Pos                     (8)
#define  MindPWM_GCR0_RUN_Msk                     (0xFU << MindPWM_GCR0_RUN_Pos)                    /*!<*/
#define  MindPWM_GCR0_RUN                         MindPWM_GCR0_RUN_Msk
#define  MindPWM_GCR0_RUN_Bit0                    (0x1U << MindPWM_GCR0_RUN_Pos) 
#define  MindPWM_GCR0_RUN_Bit1                    (0x2U << MindPWM_GCR0_RUN_Pos) 
#define  MindPWM_GCR0_RUN_Bit2                    (0x4U << MindPWM_GCR0_RUN_Pos) 
#define  MindPWM_GCR0_RUN_Bit3                    (0x8U << MindPWM_GCR0_RUN_Pos) 
#define  MindPWM_GCR0_IPOL_Pos                    (12)
#define  MindPWM_GCR0_IPOL_Msk                    (0xFU << MindPWM_GCR0_IPOL_Pos)                   /*!<*/
#define  MindPWM_GCR0_IPOL                        MindPWM_GCR0_IPOL_Msk
#define  MindPWM_GCR0_IPOL_Bit0                   (0x1U << MindPWM_GCR0_IPOL_Pos) 
#define  MindPWM_GCR0_IPOL_Bit1                   (0x2U << MindPWM_GCR0_IPOL_Pos) 
#define  MindPWM_GCR0_IPOL_Bit2                   (0x4U << MindPWM_GCR0_IPOL_Pos) 
#define  MindPWM_GCR0_IPOL_Bit3                   (0x8U << MindPWM_GCR0_IPOL_Pos) 
#define  MindPWM_GCR0_PWMX_EN_Pos                 (16)
#define  MindPWM_GCR0_PWMX_EN_Msk                 (0xFU << MindPWM_GCR0_PWMX_EN_Pos)                /*!<*/
#define  MindPWM_GCR0_PWMX_EN                     MindPWM_GCR0_PWMX_EN_Msk
#define  MindPWM_GCR0_PWMX_EN_Bit0                (0x1U << MindPWM_GCR0_PWMX_EN_Pos) 
#define  MindPWM_GCR0_PWMX_EN_Bit1                (0x2U << MindPWM_GCR0_PWMX_EN_Pos) 
#define  MindPWM_GCR0_PWMX_EN_Bit2                (0x4U << MindPWM_GCR0_PWMX_EN_Pos) 
#define  MindPWM_GCR0_PWMX_EN_Bit3                (0x8U << MindPWM_GCR0_PWMX_EN_Pos) 
#define  MindPWM_GCR0_PWMA_EN_Pos                 (20)
#define  MindPWM_GCR0_PWMA_EN_Msk                 (0xFU << MindPWM_GCR0_PWMA_EN_Pos)                /*!<*/
#define  MindPWM_GCR0_PWMA_EN                     MindPWM_GCR0_PWMA_EN_Msk
#define  MindPWM_GCR0_PWMA_EN_Bit0                (0x1U << MindPWM_GCR0_PWMA_EN_Pos) 
#define  MindPWM_GCR0_PWMA_EN_Bit1                (0x2U << MindPWM_GCR0_PWMA_EN_Pos) 
#define  MindPWM_GCR0_PWMA_EN_Bit2                (0x4U << MindPWM_GCR0_PWMA_EN_Pos) 
#define  MindPWM_GCR0_PWMA_EN_Bit3                (0x8U << MindPWM_GCR0_PWMA_EN_Pos) 
#define  MindPWM_GCR0_PWMB_EN_Pos                 (24)
#define  MindPWM_GCR0_PWMB_EN_Msk                 (0xFU << MindPWM_GCR0_PWMB_EN_Pos)                /*!<*/
#define  MindPWM_GCR0_PWMB_EN                     MindPWM_GCR0_PWMB_EN_Msk
#define  MindPWM_GCR0_PWMB_EN_Bit0                (0x1U << MindPWM_GCR0_PWMB_EN_Pos) 
#define  MindPWM_GCR0_PWMB_EN_Bit1                (0x2U << MindPWM_GCR0_PWMB_EN_Pos) 
#define  MindPWM_GCR0_PWMB_EN_Bit2                (0x4U << MindPWM_GCR0_PWMB_EN_Pos) 
#define  MindPWM_GCR0_PWMB_EN_Bit3                (0x8U << MindPWM_GCR0_PWMB_EN_Pos) 

/**
  * @brief MindPWM_GCR1 Register Bit Definition
  */
#define  MindPWM_GCR1_MASKX_Pos                   (0)
#define  MindPWM_GCR1_MASKX_Msk                   (0xFU << MindPWM_GCR1_MASKX_Pos)                  /*!<*/
#define  MindPWM_GCR1_MASKX                       MindPWM_GCR1_MASKX_Msk
#define  MindPWM_GCR1_MASKX_Bit0                  (0x1U << MindPWM_GCR1_MASKX_Pos) 
#define  MindPWM_GCR1_MASKX_Bit1                  (0x2U << MindPWM_GCR1_MASKX_Pos) 
#define  MindPWM_GCR1_MASKX_Bit2                  (0x4U << MindPWM_GCR1_MASKX_Pos) 
#define  MindPWM_GCR1_MASKX_Bit3                  (0x8U << MindPWM_GCR1_MASKX_Pos) 
#define  MindPWM_GCR1_MASKA_Pos                   (4)
#define  MindPWM_GCR1_MASKA_Msk                   (0xFU << MindPWM_GCR1_MASKA_Pos)                  /*!<*/
#define  MindPWM_GCR1_MASKA                       MindPWM_GCR1_MASKA_Msk
#define  MindPWM_GCR1_MASKA_Bit0                  (0x1U << MindPWM_GCR1_MASKA_Pos) 
#define  MindPWM_GCR1_MASKA_Bit1                  (0x2U << MindPWM_GCR1_MASKA_Pos) 
#define  MindPWM_GCR1_MASKA_Bit2                  (0x4U << MindPWM_GCR1_MASKA_Pos) 
#define  MindPWM_GCR1_MASKA_Bit3                  (0x8U << MindPWM_GCR1_MASKA_Pos) 
#define  MindPWM_GCR1_MASKB_Pos                   (8)
#define  MindPWM_GCR1_MASKB_Msk                   (0xFU << MindPWM_GCR1_MASKB_Pos)                  /*!<*/
#define  MindPWM_GCR1_MASKB                       MindPWM_GCR1_MASKB_Msk
#define  MindPWM_GCR1_MASKB_Bit0                  (0x1U << MindPWM_GCR1_MASKB_Pos) 
#define  MindPWM_GCR1_MASKB_Bit1                  (0x2U << MindPWM_GCR1_MASKB_Pos) 
#define  MindPWM_GCR1_MASKB_Bit2                  (0x4U << MindPWM_GCR1_MASKB_Pos) 
#define  MindPWM_GCR1_MASKB_Bit3                  (0x8U << MindPWM_GCR1_MASKB_Pos) 
#define  MindPWM_GCR1_MASK_UP_Pos                 (12)
#define  MindPWM_GCR1_MASK_UP_Msk                 (0xFU << MindPWM_GCR1_MASK_UP_Pos)                /*!<*/
#define  MindPWM_GCR1_MASK_UP                     MindPWM_GCR1_MASK_UP_Msk
#define  MindPWM_GCR1_MASK_UP_Bit0                (0x1U << MindPWM_GCR1_MASK_UP_Pos) 
#define  MindPWM_GCR1_MASK_UP_Bit1                (0x2U << MindPWM_GCR1_MASK_UP_Pos) 
#define  MindPWM_GCR1_MASK_UP_Bit2                (0x4U << MindPWM_GCR1_MASK_UP_Pos) 
#define  MindPWM_GCR1_MASK_UP_Bit3                (0x8U << MindPWM_GCR1_MASK_UP_Pos) 
#define  MindPWM_GCR1_HRPWM_LDO_EN_Pos            (28)
#define  MindPWM_GCR1_HRPWM_LDO_EN_Msk            (0x1U << MindPWM_GCR1_HRPWM_LDO_EN_Pos)           /*!<*/
#define  MindPWM_GCR1_HRPWM_LDO_EN                MindPWM_GCR1_HRPWM_LDO_EN_Msk
#define  MindPWM_GCR1_MON_CSS_Pos                 (30)
#define  MindPWM_GCR1_MON_CSS_Msk                 (0x1U << MindPWM_GCR1_MON_CSS_Pos)                /*!<*/
#define  MindPWM_GCR1_MON_CSS                     MindPWM_GCR1_MON_CSS_Msk
#define  MindPWM_GCR1_MON_LOCK_Pos                (31)
#define  MindPWM_GCR1_MON_LOCK_Msk                (0x1U << MindPWM_GCR1_MON_LOCK_Pos)               /*!<*/
#define  MindPWM_GCR1_MON_LOCK                    MindPWM_GCR1_MON_LOCK_Msk

/**
  * @brief MindPWM_DTCR Register Bit Definition
  */
#define  MindPWM_DTCR_SMnPWMA_DTSEL_Pos           (0)
#define  MindPWM_DTCR_SMnPWMA_DTSEL_Msk           (0xFFU << MindPWM_DTCR_SMnPWMA_DTSEL_Pos)         /*!<*/
#define  MindPWM_DTCR_SMnPWMA_DTSEL               MindPWM_DTCR_SMnPWMA_DTSEL_Msk
#define  MindPWM_DTCR_SMnPWMA_DTSEL_Bit0          (0x01U << MindPWM_DTCR_SMnPWMA_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMA_DTSEL_Bit1          (0x02U << MindPWM_DTCR_SMnPWMA_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMA_DTSEL_Bit2          (0x04U << MindPWM_DTCR_SMnPWMA_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMA_DTSEL_Bit3          (0x08U << MindPWM_DTCR_SMnPWMA_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMA_DTSEL_Bit4          (0x10U << MindPWM_DTCR_SMnPWMA_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMA_DTSEL_Bit5          (0x20U << MindPWM_DTCR_SMnPWMA_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMA_DTSEL_Bit6          (0x40U << MindPWM_DTCR_SMnPWMA_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMA_DTSEL_Bit7          (0x80U << MindPWM_DTCR_SMnPWMA_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSEL_Pos           (8)
#define  MindPWM_DTCR_SMnPWMB_DTSEL_Msk           (0xFFU << MindPWM_DTCR_SMnPWMB_DTSEL_Pos)         /*!<*/
#define  MindPWM_DTCR_SMnPWMB_DTSEL               MindPWM_DTCR_SMnPWMB_DTSEL_Msk
#define  MindPWM_DTCR_SMnPWMB_DTSEL_Bit0          (0x01U << MindPWM_DTCR_SMnPWMB_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSEL_Bit1          (0x02U << MindPWM_DTCR_SMnPWMB_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSEL_Bit2          (0x04U << MindPWM_DTCR_SMnPWMB_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSEL_Bit3          (0x08U << MindPWM_DTCR_SMnPWMB_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSEL_Bit4          (0x10U << MindPWM_DTCR_SMnPWMB_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSEL_Bit5          (0x20U << MindPWM_DTCR_SMnPWMB_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSEL_Bit6          (0x40U << MindPWM_DTCR_SMnPWMB_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSEL_Bit7          (0x80U << MindPWM_DTCR_SMnPWMB_DTSEL_Pos) 
#define  MindPWM_DTCR_SMnPWMA_DTSW_Pos            (16)
#define  MindPWM_DTCR_SMnPWMA_DTSW_Msk            (0xFU << MindPWM_DTCR_SMnPWMA_DTSW_Pos)           /*!<*/
#define  MindPWM_DTCR_SMnPWMA_DTSW                MindPWM_DTCR_SMnPWMA_DTSW_Msk
#define  MindPWM_DTCR_SMnPWMA_DTSW_Bit0           (0x1U << MindPWM_DTCR_SMnPWMA_DTSW_Pos) 
#define  MindPWM_DTCR_SMnPWMA_DTSW_Bit1           (0x2U << MindPWM_DTCR_SMnPWMA_DTSW_Pos) 
#define  MindPWM_DTCR_SMnPWMA_DTSW_Bit2           (0x4U << MindPWM_DTCR_SMnPWMA_DTSW_Pos) 
#define  MindPWM_DTCR_SMnPWMA_DTSW_Bit3           (0x8U << MindPWM_DTCR_SMnPWMA_DTSW_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSW_Pos            (20)
#define  MindPWM_DTCR_SMnPWMB_DTSW_Msk            (0xFU << MindPWM_DTCR_SMnPWMB_DTSW_Pos)           /*!<*/
#define  MindPWM_DTCR_SMnPWMB_DTSW                MindPWM_DTCR_SMnPWMB_DTSW_Msk
#define  MindPWM_DTCR_SMnPWMB_DTSW_Bit0           (0x1U << MindPWM_DTCR_SMnPWMB_DTSW_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSW_Bit1           (0x2U << MindPWM_DTCR_SMnPWMB_DTSW_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSW_Bit2           (0x4U << MindPWM_DTCR_SMnPWMB_DTSW_Pos) 
#define  MindPWM_DTCR_SMnPWMB_DTSW_Bit3           (0x8U << MindPWM_DTCR_SMnPWMB_DTSW_Pos) 

/**
  * @brief MindPWM_FCCR0 Register Bit Definition
  */
#define  MindPWM_FCCR0_FIE_Pos                    (0)
#define  MindPWM_FCCR0_FIE_Msk                    (0xFU << MindPWM_FCCR0_FIE_Pos)                   /*!<*/
#define  MindPWM_FCCR0_FIE                        MindPWM_FCCR0_FIE_Msk
#define  MindPWM_FCCR0_FIE_Bit0                   (0x1U << MindPWM_FCCR0_FIE_Pos) 
#define  MindPWM_FCCR0_FIE_Bit1                   (0x2U << MindPWM_FCCR0_FIE_Pos) 
#define  MindPWM_FCCR0_FIE_Bit2                   (0x4U << MindPWM_FCCR0_FIE_Pos) 
#define  MindPWM_FCCR0_FIE_Bit3                   (0x8U << MindPWM_FCCR0_FIE_Pos) 
#define  MindPWM_FCCR0_FSAFE_Pos                  (4)
#define  MindPWM_FCCR0_FSAFE_Msk                  (0xFU << MindPWM_FCCR0_FSAFE_Pos)                 /*!<*/
#define  MindPWM_FCCR0_FSAFE                      MindPWM_FCCR0_FSAFE_Msk
#define  MindPWM_FCCR0_FSAFE_Bit0                 (0x1U << MindPWM_FCCR0_FSAFE_Pos) 
#define  MindPWM_FCCR0_FSAFE_Bit1                 (0x2U << MindPWM_FCCR0_FSAFE_Pos) 
#define  MindPWM_FCCR0_FSAFE_Bit2                 (0x4U << MindPWM_FCCR0_FSAFE_Pos) 
#define  MindPWM_FCCR0_FSAFE_Bit3                 (0x8U << MindPWM_FCCR0_FSAFE_Pos) 
#define  MindPWM_FCCR0_FAUTO_Pos                  (8)
#define  MindPWM_FCCR0_FAUTO_Msk                  (0xFU << MindPWM_FCCR0_FAUTO_Pos)                 /*!<*/
#define  MindPWM_FCCR0_FAUTO                      MindPWM_FCCR0_FAUTO_Msk
#define  MindPWM_FCCR0_FAUTO_Bit0                 (0x1U << MindPWM_FCCR0_FAUTO_Pos) 
#define  MindPWM_FCCR0_FAUTO_Bit1                 (0x2U << MindPWM_FCCR0_FAUTO_Pos) 
#define  MindPWM_FCCR0_FAUTO_Bit2                 (0x4U << MindPWM_FCCR0_FAUTO_Pos) 
#define  MindPWM_FCCR0_FAUTO_Bit3                 (0x8U << MindPWM_FCCR0_FAUTO_Pos) 
#define  MindPWM_FCCR0_FLVL_Pos                   (12)
#define  MindPWM_FCCR0_FLVL_Msk                   (0xFU << MindPWM_FCCR0_FLVL_Pos)                  /*!<*/
#define  MindPWM_FCCR0_FLVL                       MindPWM_FCCR0_FLVL_Msk
#define  MindPWM_FCCR0_FLVL_Bit0                  (0x1U << MindPWM_FCCR0_FLVL_Pos) 
#define  MindPWM_FCCR0_FLVL_Bit1                  (0x2U << MindPWM_FCCR0_FLVL_Pos) 
#define  MindPWM_FCCR0_FLVL_Bit2                  (0x4U << MindPWM_FCCR0_FLVL_Pos) 
#define  MindPWM_FCCR0_FLVL_Bit3                  (0x8U << MindPWM_FCCR0_FLVL_Pos) 
#define  MindPWM_FCCR0_FFULL_Pos                  (16)
#define  MindPWM_FCCR0_FFULL_Msk                  (0xFU << MindPWM_FCCR0_FFULL_Pos)                 /*!<*/
#define  MindPWM_FCCR0_FFULL                      MindPWM_FCCR0_FFULL_Msk
#define  MindPWM_FCCR0_FFULL_Bit0                 (0x1U << MindPWM_FCCR0_FFULL_Pos) 
#define  MindPWM_FCCR0_FFULL_Bit1                 (0x2U << MindPWM_FCCR0_FFULL_Pos) 
#define  MindPWM_FCCR0_FFULL_Bit2                 (0x4U << MindPWM_FCCR0_FFULL_Pos) 
#define  MindPWM_FCCR0_FFULL_Bit3                 (0x8U << MindPWM_FCCR0_FFULL_Pos) 
#define  MindPWM_FCCR0_FHALF_Pos                  (20)
#define  MindPWM_FCCR0_FHALF_Msk                  (0xFU << MindPWM_FCCR0_FHALF_Pos)                 /*!<*/
#define  MindPWM_FCCR0_FHALF                      MindPWM_FCCR0_FHALF_Msk
#define  MindPWM_FCCR0_FHALF_Bit0                 (0x1U << MindPWM_FCCR0_FHALF_Pos) 
#define  MindPWM_FCCR0_FHALF_Bit1                 (0x2U << MindPWM_FCCR0_FHALF_Pos) 
#define  MindPWM_FCCR0_FHALF_Bit2                 (0x4U << MindPWM_FCCR0_FHALF_Pos) 
#define  MindPWM_FCCR0_FHALF_Bit3                 (0x8U << MindPWM_FCCR0_FHALF_Pos) 
#define  MindPWM_FCCR0_FFLAG_Pos                  (24)
#define  MindPWM_FCCR0_FFLAG_Msk                  (0xFU << MindPWM_FCCR0_FFLAG_Pos)                 /*!<*/
#define  MindPWM_FCCR0_FFLAG                      MindPWM_FCCR0_FFLAG_Msk
#define  MindPWM_FCCR0_FFLAG_Bit0                 (0x1U << MindPWM_FCCR0_FFLAG_Pos) 
#define  MindPWM_FCCR0_FFLAG_Bit1                 (0x2U << MindPWM_FCCR0_FFLAG_Pos) 
#define  MindPWM_FCCR0_FFLAG_Bit2                 (0x4U << MindPWM_FCCR0_FFLAG_Pos) 
#define  MindPWM_FCCR0_FFLAG_Bit3                 (0x8U << MindPWM_FCCR0_FFLAG_Pos) 
#define  MindPWM_FCCR0_FFPIN_Pos                  (28)
#define  MindPWM_FCCR0_FFPIN_Msk                  (0xFU << MindPWM_FCCR0_FFPIN_Pos)                 /*!<*/
#define  MindPWM_FCCR0_FFPIN                      MindPWM_FCCR0_FFPIN_Msk
#define  MindPWM_FCCR0_FFPIN_Bit0                 (0x1U << MindPWM_FCCR0_FFPIN_Pos) 
#define  MindPWM_FCCR0_FFPIN_Bit1                 (0x2U << MindPWM_FCCR0_FFPIN_Pos) 
#define  MindPWM_FCCR0_FFPIN_Bit2                 (0x4U << MindPWM_FCCR0_FFPIN_Pos) 
#define  MindPWM_FCCR0_FFPIN_Bit3                 (0x8U << MindPWM_FCCR0_FFPIN_Pos) 

/**
  * @brief MindPWM_FCCR1 Register Bit Definition
  */
#define  MindPWM_FCCR1_FILT_PER_Pos               (0)
#define  MindPWM_FCCR1_FILT_PER_Msk               (0xFFU << MindPWM_FCCR1_FILT_PER_Pos)             /*!<*/
#define  MindPWM_FCCR1_FILT_PER                   MindPWM_FCCR1_FILT_PER_Msk
#define  MindPWM_FCCR1_FILT_PER_Bit0              (0x01U << MindPWM_FCCR1_FILT_PER_Pos) 
#define  MindPWM_FCCR1_FILT_PER_Bit1              (0x02U << MindPWM_FCCR1_FILT_PER_Pos) 
#define  MindPWM_FCCR1_FILT_PER_Bit2              (0x04U << MindPWM_FCCR1_FILT_PER_Pos) 
#define  MindPWM_FCCR1_FILT_PER_Bit3              (0x08U << MindPWM_FCCR1_FILT_PER_Pos) 
#define  MindPWM_FCCR1_FILT_PER_Bit4              (0x10U << MindPWM_FCCR1_FILT_PER_Pos) 
#define  MindPWM_FCCR1_FILT_PER_Bit5              (0x20U << MindPWM_FCCR1_FILT_PER_Pos) 
#define  MindPWM_FCCR1_FILT_PER_Bit6              (0x40U << MindPWM_FCCR1_FILT_PER_Pos) 
#define  MindPWM_FCCR1_FILT_PER_Bit7              (0x80U << MindPWM_FCCR1_FILT_PER_Pos) 
#define  MindPWM_FCCR1_FILT_CNT_Pos               (8)
#define  MindPWM_FCCR1_FILT_CNT_Msk               (0x7U << MindPWM_FCCR1_FILT_CNT_Pos)              /*!<*/
#define  MindPWM_FCCR1_FILT_CNT                   MindPWM_FCCR1_FILT_CNT_Msk
#define  MindPWM_FCCR1_FILT_CNT_Bit0              (0x1U << MindPWM_FCCR1_FILT_CNT_Pos) 
#define  MindPWM_FCCR1_FILT_CNT_Bit1              (0x2U << MindPWM_FCCR1_FILT_CNT_Pos) 
#define  MindPWM_FCCR1_FILT_CNT_Bit2              (0x4U << MindPWM_FCCR1_FILT_CNT_Pos) 
#define  MindPWM_FCCR1_FEN_Pos                    (15)
#define  MindPWM_FCCR1_FEN_Msk                    (0xFU << MindPWM_FCCR1_FEN_Pos)  
#define  MindPWM_FCCR1_NOCOMB_Pos                 (16)
#define  MindPWM_FCCR1_NOCOMB_Msk                 (0xFU << MindPWM_FCCR1_NOCOMB_Pos)                /*!<*/
#define  MindPWM_FCCR1_NOCOMB                     MindPWM_FCCR1_NOCOMB_Msk
#define  MindPWM_FCCR1_NOCOMB_Bit0                (0x1U << MindPWM_FCCR1_NOCOMB_Pos) 
#define  MindPWM_FCCR1_NOCOMB_Bit1                (0x2U << MindPWM_FCCR1_NOCOMB_Pos) 
#define  MindPWM_FCCR1_NOCOMB_Bit2                (0x4U << MindPWM_FCCR1_NOCOMB_Pos) 
#define  MindPWM_FCCR1_NOCOMB_Bit3                (0x8U << MindPWM_FCCR1_NOCOMB_Pos) 
#define  MindPWM_FCCR1_GSTR_Pos                   (30)
#define  MindPWM_FCCR1_GSTR_Msk                   (0x1U << MindPWM_FCCR1_GSTR_Pos)                  /*!<*/
#define  MindPWM_FCCR1_GSTR                       MindPWM_FCCR1_GSTR_Msk
#define  MindPWM_FCCR1_FTEST_Pos                  (31)
#define  MindPWM_FCCR1_FTEST_Msk                  (0x1U << MindPWM_FCCR1_FTEST_Pos)                 /*!<*/
#define  MindPWM_FCCR1_FTEST                      MindPWM_FCCR1_FTEST_Msk


#endif

